PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Mon Apr  1 15:37:25 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("button_led1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/arturs/AE_Custom_Linux_kernels_Yocto/AE_PRU_uart_exper
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14
      15$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__delay_cycles")
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external
      19$C$DW$2 .dwtag  DW_TAG_formal_parameter

     133;  83 |         if (delay_time == 0) {                                         
     134;----------------------------------------------------------------------
     135 00000014 00008024FFFFC0          LDI32     r0, 0xffff0000        ; [ALU_PRU] |61| 
         0000001b 00000000004024 
     136 0000001c 00000010E0FEFE          AND       r30, r30, r0          ; [ALU_PRU] |61| 
     137        .dwpsn  file "button_led1.c",line 56,column 17,is_stmt,isa 0
     138 00000020 0000002EFF8180          ZERO      &r0, 4                ; [ALU_PRU] |56| delay_time
     139 00000024 00000021000000!         JMP       ||$C$L2||             ; [ALU_PRU] 
     140;* --------------------------------------------------------------------------*
     141 00000028                 ||$C$L1||:    
     142        .dwpsn  file "button_led1.c",line 84,column 4,is_stmt,isa 0
     143;----------------------------------------------------------------------
     144;  84 | __delay_cycles(LONG_CYCLE);                                            
     145;  85 | } else {                                                               
     146;----------------------------------------------------------------------
     147        .newblock
     148 00000028 259F8F240026CF          LDI32    r15, 2499999
         0000002f 00000000004024 
     149 00000030 0000000501EFEF  $1:     SUB      r15, r15, 1
     150 00000034 0000006F00EFFF          QBNE     $1, r15, 0            ; [ALU_PRU] |84| 
     151;* --------------------------------------------------------------------------*
     152;*   BEGIN LOOP ||$C$L2||
     153;* --------------------------------------------------------------------------*
     154 00000038                 ||$C$L2||:    
     155        .dwpsn  file "button_led1.c",line 65,column 3,is_stmt,isa 0
     156 00000038 000000C91FFF09          QBBC      ||$C$L4||, r31, 0x1f  ; [ALU_PRU] |65| 
     157;* --------------------------------------------------------------------------*
     158        .dwpsn  file "button_led1.c",line 71,column 5,is_stmt,isa 0
     159 0000003c 0000002EFF818F          ZERO      &r15, 4               ; [ALU_PRU] |71| 
     160 00000040 0000006900E002          QBNE      ||$C$L3||, r0, 0x00   ; [ALU_PRU] |71| delay_time
     161;* --------------------------------------------------------------------------*
     162 00000044 000000240001EF          LDI       r15, 0x0001           ; [ALU_PRU] |71| 
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    4

     163;* --------------------------------------------------------------------------*
     164 00000048                 ||$C$L3||:    
     165 00000048 00000010EFEFE0          MOV       r0, r15               ; [ALU_PRU] |71| delay_time
     166        .dwpsn  file "button_led1.c",line 74,column 4,is_stmt,isa 0
     167 0000004c 000000E1242E81          SBBO      &r1, r14, 36, 4       ; [ALU_PRU] |74| $O$K15,$O$K13
     168        .dwpsn  file "button_led1.c",line 76,column 4,is_stmt,isa 0
     169        .newblock
     170 00000050 0000002400028F          LDI      r15.w0, 2
     171 00000054 00000005018F8F  $1:     SUB      r15.w0, r15.w0, 1
     172 00000058 0000006F008FFF          QBNE     $1, r15.w0, 0         ; [ALU_PRU] |76| 
     173;* --------------------------------------------------------------------------*
     174 0000005c                 ||$C$L4||:    
     175        .dwpsn  file "button_led1.c",line 79,column 17,is_stmt,isa 0
     176 0000005c 000000241000EF          LDI       r15, 0x1000           ; [ALU_PRU] |79| 
     177 00000060 00000014EFFEFE          XOR       r30, r30, r15         ; [ALU_PRU] |79| 
     178        .dwpsn  file "button_led1.c",line 80,column 17,is_stmt,isa 0
     179 00000064 000000242000EF          LDI       r15, 0x2000           ; [ALU_PRU] |80| 
     180 00000068 00000014EFFEFE          XOR       r30, r30, r15         ; [ALU_PRU] |80| 
     181        .dwpsn  file "button_led1.c",line 83,column 3,is_stmt,isa 0
     182 0000006c 0000005700E0EF          QBEQ      ||$C$L1||, r0, 0x00   ; [ALU_PRU] |83| delay_time
     183;* --------------------------------------------------------------------------*
     184        .dwpsn  file "button_led1.c",line 86,column 4,is_stmt,isa 0
     185;----------------------------------------------------------------------
     186;  86 | __delay_cycles(SHORT_CYCLE);                                           
     187;----------------------------------------------------------------------
     188        .newblock
     189 00000070 D08F8F240003CF          LDI32    r15, 249999
         00000077 00000000004024 
     190 00000078 0000000501EFEF  $1:     SUB      r15, r15, 1
     191 0000007c 0000006F00EFFF          QBNE     $1, r15, 0            ; [ALU_PRU] |86| 
     192 00000080 00000021000000!         JMP       ||$C$L2||             ; [ALU_PRU] |86| 
     193;* --------------------------------------------------------------------------*
     194        .dwattr $C$DW$6, DW_AT_TI_end_file("button_led1.c")
     195        .dwattr $C$DW$6, DW_AT_TI_end_line(0x59)
     196        .dwattr $C$DW$6, DW_AT_TI_end_column(0x01)
     197        .dwendentry
     198        .dwendtag $C$DW$6
     199
     200
     201;******************************************************************************
     202;* TYPE INFORMATION                                                           *
     203;******************************************************************************
     204
     205$C$DW$T$19      .dwtag  DW_TAG_structure_type
     206        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     207$C$DW$8 .dwtag  DW_TAG_member
     208        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     209        .dwattr $C$DW$8, DW_AT_name("REVID")
     210        .dwattr $C$DW$8, DW_AT_TI_symbol_name("REVID")
     211        .dwattr $C$DW$8, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     212        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     213        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     214        .dwattr $C$DW$8, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_e
     215        .dwattr $C$DW$8, DW_AT_decl_line(0x2d)
     216        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    5

     217        .dwendtag $C$DW$T$19
     218
     219        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     220        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     221        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     222$C$DW$T$108     .dwtag  DW_TAG_volatile_type
     223        .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$19)
     224
     225$C$DW$T$20      .dwtag  DW_TAG_structure_type
     226        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     227$C$DW$9 .dwtag  DW_TAG_member
     228        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     229        .dwattr $C$DW$9, DW_AT_name("IDLE_MODE")
     230        .dwattr $C$DW$9, DW_AT_TI_symbol_name("IDLE_MODE")
     231        .dwattr $C$DW$9, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     232        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     233        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     234        .dwattr $C$DW$9, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_e
     235        .dwattr $C$DW$9, DW_AT_decl_line(0x37)
     236        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     237$C$DW$10        .dwtag  DW_TAG_member
     238        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     239        .dwattr $C$DW$10, DW_AT_name("STANDBY_MODE")
     240        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_MODE")
     241        .dwattr $C$DW$10, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     242        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     243        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     244        .dwattr $C$DW$10, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     245        .dwattr $C$DW$10, DW_AT_decl_line(0x38)
     246        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     247$C$DW$11        .dwtag  DW_TAG_member
     248        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     249        .dwattr $C$DW$11, DW_AT_name("STANDBY_INIT")
     250        .dwattr $C$DW$11, DW_AT_TI_symbol_name("STANDBY_INIT")
     251        .dwattr $C$DW$11, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     252        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     253        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     254        .dwattr $C$DW$11, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     255        .dwattr $C$DW$11, DW_AT_decl_line(0x39)
     256        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     257$C$DW$12        .dwtag  DW_TAG_member
     258        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     259        .dwattr $C$DW$12, DW_AT_name("SUB_MWAIT")
     260        .dwattr $C$DW$12, DW_AT_TI_symbol_name("SUB_MWAIT")
     261        .dwattr $C$DW$12, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     262        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     263        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     264        .dwattr $C$DW$12, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     265        .dwattr $C$DW$12, DW_AT_decl_line(0x3a)
     266        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     267$C$DW$13        .dwtag  DW_TAG_member
     268        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     269        .dwattr $C$DW$13, DW_AT_name("rsvd6")
     270        .dwattr $C$DW$13, DW_AT_TI_symbol_name("rsvd6")
     271        .dwattr $C$DW$13, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    6

     272        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     274        .dwattr $C$DW$13, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     275        .dwattr $C$DW$13, DW_AT_decl_line(0x3b)
     276        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     277        .dwendtag $C$DW$T$20
     278
     279        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     280        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     281        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     282$C$DW$T$110     .dwtag  DW_TAG_volatile_type
     283        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$20)
     284
     285$C$DW$T$21      .dwtag  DW_TAG_structure_type
     286        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     287$C$DW$14        .dwtag  DW_TAG_member
     288        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     289        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_MODE")
     290        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     291        .dwattr $C$DW$14, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     292        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     293        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     294        .dwattr $C$DW$14, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     295        .dwattr $C$DW$14, DW_AT_decl_line(0x45)
     296        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     297$C$DW$15        .dwtag  DW_TAG_member
     298        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     299        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_CLK_MODE")
     300        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     301        .dwattr $C$DW$15, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     302        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     303        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     304        .dwattr $C$DW$15, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     305        .dwattr $C$DW$15, DW_AT_decl_line(0x46)
     306        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     307$C$DW$16        .dwtag  DW_TAG_member
     308        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     309        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV0")
     310        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     311        .dwattr $C$DW$16, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     312        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     313        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     314        .dwattr $C$DW$16, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     315        .dwattr $C$DW$16, DW_AT_decl_line(0x47)
     316        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     317$C$DW$17        .dwtag  DW_TAG_member
     318        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     319        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_DIV1")
     320        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     321        .dwattr $C$DW$17, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     322        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     323        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     324        .dwattr $C$DW$17, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     325        .dwattr $C$DW$17, DW_AT_decl_line(0x48)
     326        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    7

     327$C$DW$18        .dwtag  DW_TAG_member
     328        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     329        .dwattr $C$DW$18, DW_AT_name("PRU0_GPI_SB")
     330        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     331        .dwattr $C$DW$18, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     332        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     334        .dwattr $C$DW$18, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     335        .dwattr $C$DW$18, DW_AT_decl_line(0x49)
     336        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     337$C$DW$19        .dwtag  DW_TAG_member
     338        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     339        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_MODE")
     340        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     341        .dwattr $C$DW$19, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     342        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     343        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     344        .dwattr $C$DW$19, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     345        .dwattr $C$DW$19, DW_AT_decl_line(0x4a)
     346        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     347$C$DW$20        .dwtag  DW_TAG_member
     348        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     349        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV0")
     350        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     351        .dwattr $C$DW$20, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     352        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     354        .dwattr $C$DW$20, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     355        .dwattr $C$DW$20, DW_AT_decl_line(0x4b)
     356        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     357$C$DW$21        .dwtag  DW_TAG_member
     358        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     359        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_DIV1")
     360        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     361        .dwattr $C$DW$21, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     362        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     363        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     364        .dwattr $C$DW$21, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     365        .dwattr $C$DW$21, DW_AT_decl_line(0x4c)
     366        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     367$C$DW$22        .dwtag  DW_TAG_member
     368        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     369        .dwattr $C$DW$22, DW_AT_name("PRU0_GPO_SH_SEL")
     370        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     371        .dwattr $C$DW$22, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     372        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     373        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     374        .dwattr $C$DW$22, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     375        .dwattr $C$DW$22, DW_AT_decl_line(0x4d)
     376        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     377$C$DW$23        .dwtag  DW_TAG_member
     378        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     379        .dwattr $C$DW$23, DW_AT_name("rsvd26")
     380        .dwattr $C$DW$23, DW_AT_TI_symbol_name("rsvd26")
     381        .dwattr $C$DW$23, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    8

     382        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     384        .dwattr $C$DW$23, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     385        .dwattr $C$DW$23, DW_AT_decl_line(0x4e)
     386        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     387        .dwendtag $C$DW$T$21
     388
     389        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     390        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     391        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     392$C$DW$T$112     .dwtag  DW_TAG_volatile_type
     393        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$21)
     394
     395$C$DW$T$22      .dwtag  DW_TAG_structure_type
     396        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     397$C$DW$24        .dwtag  DW_TAG_member
     398        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     399        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_MODE")
     400        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     401        .dwattr $C$DW$24, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     402        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     403        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     404        .dwattr $C$DW$24, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     405        .dwattr $C$DW$24, DW_AT_decl_line(0x58)
     406        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     407$C$DW$25        .dwtag  DW_TAG_member
     408        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     409        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_CLK_MODE")
     410        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     411        .dwattr $C$DW$25, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     412        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     413        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     414        .dwattr $C$DW$25, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     415        .dwattr $C$DW$25, DW_AT_decl_line(0x59)
     416        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     417$C$DW$26        .dwtag  DW_TAG_member
     418        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     419        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV0")
     420        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     421        .dwattr $C$DW$26, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     422        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     423        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     424        .dwattr $C$DW$26, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     425        .dwattr $C$DW$26, DW_AT_decl_line(0x5a)
     426        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     427$C$DW$27        .dwtag  DW_TAG_member
     428        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     429        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_DIV1")
     430        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     431        .dwattr $C$DW$27, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     432        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     433        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     434        .dwattr $C$DW$27, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     435        .dwattr $C$DW$27, DW_AT_decl_line(0x5b)
     436        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE    9

     437$C$DW$28        .dwtag  DW_TAG_member
     438        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     439        .dwattr $C$DW$28, DW_AT_name("PRU1_GPI_SB")
     440        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     441        .dwattr $C$DW$28, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     442        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     444        .dwattr $C$DW$28, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     445        .dwattr $C$DW$28, DW_AT_decl_line(0x5c)
     446        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     447$C$DW$29        .dwtag  DW_TAG_member
     448        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     449        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_MODE")
     450        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     451        .dwattr $C$DW$29, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     452        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     453        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     454        .dwattr $C$DW$29, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     455        .dwattr $C$DW$29, DW_AT_decl_line(0x5d)
     456        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     457$C$DW$30        .dwtag  DW_TAG_member
     458        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     459        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV0")
     460        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     461        .dwattr $C$DW$30, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     462        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     463        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     464        .dwattr $C$DW$30, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     465        .dwattr $C$DW$30, DW_AT_decl_line(0x5e)
     466        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     467$C$DW$31        .dwtag  DW_TAG_member
     468        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     469        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_DIV1")
     470        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     471        .dwattr $C$DW$31, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     472        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     473        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     474        .dwattr $C$DW$31, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     475        .dwattr $C$DW$31, DW_AT_decl_line(0x5f)
     476        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     477$C$DW$32        .dwtag  DW_TAG_member
     478        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     479        .dwattr $C$DW$32, DW_AT_name("PRU1_GPO_SH_SEL")
     480        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     481        .dwattr $C$DW$32, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     482        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     484        .dwattr $C$DW$32, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     485        .dwattr $C$DW$32, DW_AT_decl_line(0x60)
     486        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     487$C$DW$33        .dwtag  DW_TAG_member
     488        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     489        .dwattr $C$DW$33, DW_AT_name("rsvd26")
     490        .dwattr $C$DW$33, DW_AT_TI_symbol_name("rsvd26")
     491        .dwattr $C$DW$33, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   10

     492        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     494        .dwattr $C$DW$33, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     495        .dwattr $C$DW$33, DW_AT_decl_line(0x61)
     496        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     497        .dwendtag $C$DW$T$22
     498
     499        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     500        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     501        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     502$C$DW$T$114     .dwtag  DW_TAG_volatile_type
     503        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$22)
     504
     505$C$DW$T$23      .dwtag  DW_TAG_structure_type
     506        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     507$C$DW$34        .dwtag  DW_TAG_member
     508        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     509        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_REQ")
     510        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     511        .dwattr $C$DW$34, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     512        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     514        .dwattr $C$DW$34, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     515        .dwattr $C$DW$34, DW_AT_decl_line(0x6b)
     516        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     517$C$DW$35        .dwtag  DW_TAG_member
     518        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     519        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_STOP_ACK")
     520        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     521        .dwattr $C$DW$35, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     522        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     524        .dwattr $C$DW$35, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     525        .dwattr $C$DW$35, DW_AT_decl_line(0x6c)
     526        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     527$C$DW$36        .dwtag  DW_TAG_member
     528        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     529        .dwattr $C$DW$36, DW_AT_name("PRU0_CLK_EN")
     530        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     531        .dwattr $C$DW$36, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     532        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     533        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     534        .dwattr $C$DW$36, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     535        .dwattr $C$DW$36, DW_AT_decl_line(0x6d)
     536        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     537$C$DW$37        .dwtag  DW_TAG_member
     538        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     539        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_REQ")
     540        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     541        .dwattr $C$DW$37, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     542        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     544        .dwattr $C$DW$37, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     545        .dwattr $C$DW$37, DW_AT_decl_line(0x6e)
     546        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   11

     547$C$DW$38        .dwtag  DW_TAG_member
     548        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     549        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_STOP_ACK")
     550        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     551        .dwattr $C$DW$38, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     552        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     554        .dwattr $C$DW$38, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     555        .dwattr $C$DW$38, DW_AT_decl_line(0x6f)
     556        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     557$C$DW$39        .dwtag  DW_TAG_member
     558        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     559        .dwattr $C$DW$39, DW_AT_name("PRU1_CLK_EN")
     560        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     561        .dwattr $C$DW$39, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     562        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     564        .dwattr $C$DW$39, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     565        .dwattr $C$DW$39, DW_AT_decl_line(0x70)
     566        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     567$C$DW$40        .dwtag  DW_TAG_member
     568        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     569        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_REQ")
     570        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     571        .dwattr $C$DW$40, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     572        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     573        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     574        .dwattr $C$DW$40, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     575        .dwattr $C$DW$40, DW_AT_decl_line(0x71)
     576        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     577$C$DW$41        .dwtag  DW_TAG_member
     578        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     579        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_STOP_ACK")
     580        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     581        .dwattr $C$DW$41, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     582        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     584        .dwattr $C$DW$41, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     585        .dwattr $C$DW$41, DW_AT_decl_line(0x72)
     586        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     587$C$DW$42        .dwtag  DW_TAG_member
     588        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     589        .dwattr $C$DW$42, DW_AT_name("INTC_CLK_EN")
     590        .dwattr $C$DW$42, DW_AT_TI_symbol_name("INTC_CLK_EN")
     591        .dwattr $C$DW$42, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     592        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     594        .dwattr $C$DW$42, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     595        .dwattr $C$DW$42, DW_AT_decl_line(0x73)
     596        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     597$C$DW$43        .dwtag  DW_TAG_member
     598        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     599        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_REQ")
     600        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     601        .dwattr $C$DW$43, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   12

     602        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     604        .dwattr $C$DW$43, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     605        .dwattr $C$DW$43, DW_AT_decl_line(0x74)
     606        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     607$C$DW$44        .dwtag  DW_TAG_member
     608        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     609        .dwattr $C$DW$44, DW_AT_name("UART_CLK_STOP_ACK")
     610        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     611        .dwattr $C$DW$44, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     612        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     613        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     614        .dwattr $C$DW$44, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     615        .dwattr $C$DW$44, DW_AT_decl_line(0x75)
     616        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     617$C$DW$45        .dwtag  DW_TAG_member
     618        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     619        .dwattr $C$DW$45, DW_AT_name("UART_CLK_EN")
     620        .dwattr $C$DW$45, DW_AT_TI_symbol_name("UART_CLK_EN")
     621        .dwattr $C$DW$45, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     622        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     624        .dwattr $C$DW$45, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     625        .dwattr $C$DW$45, DW_AT_decl_line(0x76)
     626        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     627$C$DW$46        .dwtag  DW_TAG_member
     628        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     629        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_REQ")
     630        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     631        .dwattr $C$DW$46, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     632        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     634        .dwattr $C$DW$46, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     635        .dwattr $C$DW$46, DW_AT_decl_line(0x77)
     636        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     637$C$DW$47        .dwtag  DW_TAG_member
     638        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     639        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_STOP_ACK")
     640        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     641        .dwattr $C$DW$47, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     642        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     644        .dwattr $C$DW$47, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     645        .dwattr $C$DW$47, DW_AT_decl_line(0x78)
     646        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     647$C$DW$48        .dwtag  DW_TAG_member
     648        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     649        .dwattr $C$DW$48, DW_AT_name("ECAP_CLK_EN")
     650        .dwattr $C$DW$48, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     651        .dwattr $C$DW$48, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     652        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     654        .dwattr $C$DW$48, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     655        .dwattr $C$DW$48, DW_AT_decl_line(0x79)
     656        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   13

     657$C$DW$49        .dwtag  DW_TAG_member
     658        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     659        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_REQ")
     660        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     661        .dwattr $C$DW$49, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     662        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     664        .dwattr $C$DW$49, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     665        .dwattr $C$DW$49, DW_AT_decl_line(0x7a)
     666        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     667$C$DW$50        .dwtag  DW_TAG_member
     668        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     669        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_STOP_ACK")
     670        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     671        .dwattr $C$DW$50, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     672        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     674        .dwattr $C$DW$50, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     675        .dwattr $C$DW$50, DW_AT_decl_line(0x7b)
     676        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     677$C$DW$51        .dwtag  DW_TAG_member
     678        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     679        .dwattr $C$DW$51, DW_AT_name("IEP_CLK_EN")
     680        .dwattr $C$DW$51, DW_AT_TI_symbol_name("IEP_CLK_EN")
     681        .dwattr $C$DW$51, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     682        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     684        .dwattr $C$DW$51, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     685        .dwattr $C$DW$51, DW_AT_decl_line(0x7c)
     686        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     687$C$DW$52        .dwtag  DW_TAG_member
     688        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     689        .dwattr $C$DW$52, DW_AT_name("rsvd18")
     690        .dwattr $C$DW$52, DW_AT_TI_symbol_name("rsvd18")
     691        .dwattr $C$DW$52, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     692        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     693        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     694        .dwattr $C$DW$52, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     695        .dwattr $C$DW$52, DW_AT_decl_line(0x7d)
     696        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     697        .dwendtag $C$DW$T$23
     698
     699        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     700        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     701        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     702$C$DW$T$116     .dwtag  DW_TAG_volatile_type
     703        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
     704
     705$C$DW$T$24      .dwtag  DW_TAG_structure_type
     706        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     707$C$DW$53        .dwtag  DW_TAG_member
     708        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     709        .dwattr $C$DW$53, DW_AT_name("PRU0_IMEM_PE_RAW")
     710        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     711        .dwattr $C$DW$53, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   14

     712        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     714        .dwattr $C$DW$53, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     715        .dwattr $C$DW$53, DW_AT_decl_line(0x87)
     716        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     717$C$DW$54        .dwtag  DW_TAG_member
     718        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     719        .dwattr $C$DW$54, DW_AT_name("PRU0_DMEM_PE_RAW")
     720        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     721        .dwattr $C$DW$54, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     722        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     724        .dwattr $C$DW$54, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     725        .dwattr $C$DW$54, DW_AT_decl_line(0x88)
     726        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     727$C$DW$55        .dwtag  DW_TAG_member
     728        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     729        .dwattr $C$DW$55, DW_AT_name("PRU1_IMEM_PE_RAW")
     730        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     731        .dwattr $C$DW$55, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     732        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     734        .dwattr $C$DW$55, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     735        .dwattr $C$DW$55, DW_AT_decl_line(0x89)
     736        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     737$C$DW$56        .dwtag  DW_TAG_member
     738        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     739        .dwattr $C$DW$56, DW_AT_name("PRU1_DMEM_PE_RAW")
     740        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     741        .dwattr $C$DW$56, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     742        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     744        .dwattr $C$DW$56, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     745        .dwattr $C$DW$56, DW_AT_decl_line(0x8a)
     746        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     747$C$DW$57        .dwtag  DW_TAG_member
     748        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     749        .dwattr $C$DW$57, DW_AT_name("RAM_PE_RAW")
     750        .dwattr $C$DW$57, DW_AT_TI_symbol_name("RAM_PE_RAW")
     751        .dwattr $C$DW$57, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     752        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     754        .dwattr $C$DW$57, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     755        .dwattr $C$DW$57, DW_AT_decl_line(0x8b)
     756        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     757$C$DW$58        .dwtag  DW_TAG_member
     758        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     759        .dwattr $C$DW$58, DW_AT_name("rsvd20")
     760        .dwattr $C$DW$58, DW_AT_TI_symbol_name("rsvd20")
     761        .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     762        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     764        .dwattr $C$DW$58, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     765        .dwattr $C$DW$58, DW_AT_decl_line(0x8c)
     766        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   15

     767        .dwendtag $C$DW$T$24
     768
     769        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     770        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     771        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     772$C$DW$T$118     .dwtag  DW_TAG_volatile_type
     773        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
     774
     775$C$DW$T$25      .dwtag  DW_TAG_structure_type
     776        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     777$C$DW$59        .dwtag  DW_TAG_member
     778        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     779        .dwattr $C$DW$59, DW_AT_name("PRU0_IMEM_PE")
     780        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     781        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     782        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     784        .dwattr $C$DW$59, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     785        .dwattr $C$DW$59, DW_AT_decl_line(0x96)
     786        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     787$C$DW$60        .dwtag  DW_TAG_member
     788        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     789        .dwattr $C$DW$60, DW_AT_name("PRU0_DMEM_PE")
     790        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     791        .dwattr $C$DW$60, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     792        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     794        .dwattr $C$DW$60, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     795        .dwattr $C$DW$60, DW_AT_decl_line(0x97)
     796        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     797$C$DW$61        .dwtag  DW_TAG_member
     798        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     799        .dwattr $C$DW$61, DW_AT_name("PRU1_IMEM_PE")
     800        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     801        .dwattr $C$DW$61, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     802        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     804        .dwattr $C$DW$61, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     805        .dwattr $C$DW$61, DW_AT_decl_line(0x98)
     806        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     807$C$DW$62        .dwtag  DW_TAG_member
     808        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     809        .dwattr $C$DW$62, DW_AT_name("PRU1_DMEM_PE")
     810        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     811        .dwattr $C$DW$62, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     812        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     814        .dwattr $C$DW$62, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     815        .dwattr $C$DW$62, DW_AT_decl_line(0x99)
     816        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     817$C$DW$63        .dwtag  DW_TAG_member
     818        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     819        .dwattr $C$DW$63, DW_AT_name("RAM_PE")
     820        .dwattr $C$DW$63, DW_AT_TI_symbol_name("RAM_PE")
     821        .dwattr $C$DW$63, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   16

     822        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     824        .dwattr $C$DW$63, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     825        .dwattr $C$DW$63, DW_AT_decl_line(0x9a)
     826        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     827$C$DW$64        .dwtag  DW_TAG_member
     828        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     829        .dwattr $C$DW$64, DW_AT_name("rsvd20")
     830        .dwattr $C$DW$64, DW_AT_TI_symbol_name("rsvd20")
     831        .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     832        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     834        .dwattr $C$DW$64, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     835        .dwattr $C$DW$64, DW_AT_decl_line(0x9b)
     836        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     837        .dwendtag $C$DW$T$25
     838
     839        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     840        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     841        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     842$C$DW$T$120     .dwtag  DW_TAG_volatile_type
     843        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
     844
     845$C$DW$T$26      .dwtag  DW_TAG_structure_type
     846        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     847$C$DW$65        .dwtag  DW_TAG_member
     848        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     849        .dwattr $C$DW$65, DW_AT_name("PRU0_IMEM_PE_SET")
     850        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     851        .dwattr $C$DW$65, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     852        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     854        .dwattr $C$DW$65, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     855        .dwattr $C$DW$65, DW_AT_decl_line(0xa4)
     856        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     857$C$DW$66        .dwtag  DW_TAG_member
     858        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     859        .dwattr $C$DW$66, DW_AT_name("PRU0_DMEM_PE_SET")
     860        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     861        .dwattr $C$DW$66, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     862        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     864        .dwattr $C$DW$66, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     865        .dwattr $C$DW$66, DW_AT_decl_line(0xa5)
     866        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     867$C$DW$67        .dwtag  DW_TAG_member
     868        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     869        .dwattr $C$DW$67, DW_AT_name("PRU1_IMEM_PE_SET")
     870        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     871        .dwattr $C$DW$67, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     872        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     874        .dwattr $C$DW$67, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     875        .dwattr $C$DW$67, DW_AT_decl_line(0xa6)
     876        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   17

     877$C$DW$68        .dwtag  DW_TAG_member
     878        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     879        .dwattr $C$DW$68, DW_AT_name("PRU1_DMEM_PE_SET")
     880        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     881        .dwattr $C$DW$68, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     882        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     884        .dwattr $C$DW$68, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     885        .dwattr $C$DW$68, DW_AT_decl_line(0xa7)
     886        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     887$C$DW$69        .dwtag  DW_TAG_member
     888        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     889        .dwattr $C$DW$69, DW_AT_name("RAM_PE_SET")
     890        .dwattr $C$DW$69, DW_AT_TI_symbol_name("RAM_PE_SET")
     891        .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     892        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     894        .dwattr $C$DW$69, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     895        .dwattr $C$DW$69, DW_AT_decl_line(0xa8)
     896        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     897$C$DW$70        .dwtag  DW_TAG_member
     898        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     899        .dwattr $C$DW$70, DW_AT_name("rsvd20")
     900        .dwattr $C$DW$70, DW_AT_TI_symbol_name("rsvd20")
     901        .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     902        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     904        .dwattr $C$DW$70, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     905        .dwattr $C$DW$70, DW_AT_decl_line(0xa9)
     906        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     907        .dwendtag $C$DW$T$26
     908
     909        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     910        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     911        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     912$C$DW$T$122     .dwtag  DW_TAG_volatile_type
     913        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$26)
     914
     915$C$DW$T$27      .dwtag  DW_TAG_structure_type
     916        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     917$C$DW$71        .dwtag  DW_TAG_member
     918        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     919        .dwattr $C$DW$71, DW_AT_name("PRU0_IMEM_PE_CLR")
     920        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     921        .dwattr $C$DW$71, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     922        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     924        .dwattr $C$DW$71, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     925        .dwattr $C$DW$71, DW_AT_decl_line(0xb3)
     926        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     927$C$DW$72        .dwtag  DW_TAG_member
     928        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     929        .dwattr $C$DW$72, DW_AT_name("PRU0_DMEM_PE_CLR")
     930        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     931        .dwattr $C$DW$72, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   18

     932        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     934        .dwattr $C$DW$72, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     935        .dwattr $C$DW$72, DW_AT_decl_line(0xb4)
     936        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     937$C$DW$73        .dwtag  DW_TAG_member
     938        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     939        .dwattr $C$DW$73, DW_AT_name("PRU1_IMEM_PE_CLR")
     940        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     941        .dwattr $C$DW$73, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     942        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     944        .dwattr $C$DW$73, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     945        .dwattr $C$DW$73, DW_AT_decl_line(0xb5)
     946        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     947$C$DW$74        .dwtag  DW_TAG_member
     948        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     949        .dwattr $C$DW$74, DW_AT_name("PRU1_DMEM_PE_CLR")
     950        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     951        .dwattr $C$DW$74, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     952        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     954        .dwattr $C$DW$74, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     955        .dwattr $C$DW$74, DW_AT_decl_line(0xb6)
     956        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     957$C$DW$75        .dwtag  DW_TAG_member
     958        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     959        .dwattr $C$DW$75, DW_AT_name("rsvd16")
     960        .dwattr $C$DW$75, DW_AT_TI_symbol_name("rsvd16")
     961        .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     962        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     964        .dwattr $C$DW$75, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     965        .dwattr $C$DW$75, DW_AT_decl_line(0xb7)
     966        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     967        .dwendtag $C$DW$T$27
     968
     969        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     970        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     971        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     972$C$DW$T$124     .dwtag  DW_TAG_volatile_type
     973        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$27)
     974
     975$C$DW$T$28      .dwtag  DW_TAG_structure_type
     976        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     977$C$DW$76        .dwtag  DW_TAG_member
     978        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     979        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU0")
     980        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU0")
     981        .dwattr $C$DW$76, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     982        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     984        .dwattr $C$DW$76, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     985        .dwattr $C$DW$76, DW_AT_decl_line(0xc4)
     986        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   19

     987$C$DW$77        .dwtag  DW_TAG_member
     988        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     989        .dwattr $C$DW$77, DW_AT_name("PMAO_PRU1")
     990        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PMAO_PRU1")
     991        .dwattr $C$DW$77, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     992        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     994        .dwattr $C$DW$77, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     995        .dwattr $C$DW$77, DW_AT_decl_line(0xc5)
     996        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     997$C$DW$78        .dwtag  DW_TAG_member
     998        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     999        .dwattr $C$DW$78, DW_AT_name("rsvd2")
    1000        .dwattr $C$DW$78, DW_AT_TI_symbol_name("rsvd2")
    1001        .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1002        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1004        .dwattr $C$DW$78, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1005        .dwattr $C$DW$78, DW_AT_decl_line(0xc6)
    1006        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1007        .dwendtag $C$DW$T$28
    1008
    1009        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1010        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1011        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1012$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1013        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$28)
    1014
    1015$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1016        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1017$C$DW$79        .dwtag  DW_TAG_member
    1018        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1019        .dwattr $C$DW$79, DW_AT_name("OCP_EN")
    1020        .dwattr $C$DW$79, DW_AT_TI_symbol_name("OCP_EN")
    1021        .dwattr $C$DW$79, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1022        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1024        .dwattr $C$DW$79, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1025        .dwattr $C$DW$79, DW_AT_decl_line(0xd3)
    1026        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1027$C$DW$80        .dwtag  DW_TAG_member
    1028        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1029        .dwattr $C$DW$80, DW_AT_name("rsvd1")
    1030        .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd1")
    1031        .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1032        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1034        .dwattr $C$DW$80, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1035        .dwattr $C$DW$80, DW_AT_decl_line(0xd4)
    1036        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1037        .dwendtag $C$DW$T$29
    1038
    1039        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1040        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1041        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   20

    1042$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1043        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$29)
    1044
    1045$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1046        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1047$C$DW$81        .dwtag  DW_TAG_member
    1048        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1049        .dwattr $C$DW$81, DW_AT_name("PRU1_PAD_HP_EN")
    1050        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1051        .dwattr $C$DW$81, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1052        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1054        .dwattr $C$DW$81, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1055        .dwattr $C$DW$81, DW_AT_decl_line(0xde)
    1056        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1057$C$DW$82        .dwtag  DW_TAG_member
    1058        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1059        .dwattr $C$DW$82, DW_AT_name("XFR_SHIFT_EN")
    1060        .dwattr $C$DW$82, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1061        .dwattr $C$DW$82, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1062        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1064        .dwattr $C$DW$82, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1065        .dwattr $C$DW$82, DW_AT_decl_line(0xdf)
    1066        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1067$C$DW$83        .dwtag  DW_TAG_member
    1068        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1069        .dwattr $C$DW$83, DW_AT_name("rsvd2")
    1070        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd2")
    1071        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1072        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1074        .dwattr $C$DW$83, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1075        .dwattr $C$DW$83, DW_AT_decl_line(0xe0)
    1076        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1077        .dwendtag $C$DW$T$30
    1078
    1079        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1080        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1081        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1082$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1083        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$30)
    1084
    1085$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1086        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1087$C$DW$84        .dwtag  DW_TAG_member
    1088        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1089        .dwattr $C$DW$84, DW_AT_name("PIN_MUX_SEL")
    1090        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1091        .dwattr $C$DW$84, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1092        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1094        .dwattr $C$DW$84, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1095        .dwattr $C$DW$84, DW_AT_decl_line(0xec)
    1096        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   21

    1097$C$DW$85        .dwtag  DW_TAG_member
    1098        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1099        .dwattr $C$DW$85, DW_AT_name("rsvd2")
    1100        .dwattr $C$DW$85, DW_AT_TI_symbol_name("rsvd2")
    1101        .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1102        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1104        .dwattr $C$DW$85, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1105        .dwattr $C$DW$85, DW_AT_decl_line(0xed)
    1106        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1107        .dwendtag $C$DW$T$31
    1108
    1109        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1110        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1111        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1112$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1113        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    1114
    1115$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1116        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1117$C$DW$86        .dwtag  DW_TAG_member
    1118        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$109)
    1119        .dwattr $C$DW$86, DW_AT_name("$P$T0")
    1120        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T0")
    1121        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1123        .dwattr $C$DW$86, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1124        .dwattr $C$DW$86, DW_AT_decl_line(0x29)
    1125        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1126$C$DW$87        .dwtag  DW_TAG_member
    1127        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$111)
    1128        .dwattr $C$DW$87, DW_AT_name("$P$T1")
    1129        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T1")
    1130        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1131        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1132        .dwattr $C$DW$87, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1133        .dwattr $C$DW$87, DW_AT_decl_line(0x33)
    1134        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1135$C$DW$88        .dwtag  DW_TAG_member
    1136        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$113)
    1137        .dwattr $C$DW$88, DW_AT_name("$P$T2")
    1138        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T2")
    1139        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1140        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1141        .dwattr $C$DW$88, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1142        .dwattr $C$DW$88, DW_AT_decl_line(0x41)
    1143        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1144$C$DW$89        .dwtag  DW_TAG_member
    1145        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$115)
    1146        .dwattr $C$DW$89, DW_AT_name("$P$T3")
    1147        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T3")
    1148        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1149        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1150        .dwattr $C$DW$89, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1151        .dwattr $C$DW$89, DW_AT_decl_line(0x54)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   22

    1152        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1153$C$DW$90        .dwtag  DW_TAG_member
    1154        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$117)
    1155        .dwattr $C$DW$90, DW_AT_name("$P$T4")
    1156        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T4")
    1157        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1158        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1159        .dwattr $C$DW$90, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1160        .dwattr $C$DW$90, DW_AT_decl_line(0x67)
    1161        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1162$C$DW$91        .dwtag  DW_TAG_member
    1163        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$119)
    1164        .dwattr $C$DW$91, DW_AT_name("$P$T5")
    1165        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T5")
    1166        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1167        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1168        .dwattr $C$DW$91, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1169        .dwattr $C$DW$91, DW_AT_decl_line(0x83)
    1170        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1171$C$DW$92        .dwtag  DW_TAG_member
    1172        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$121)
    1173        .dwattr $C$DW$92, DW_AT_name("$P$T6")
    1174        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T6")
    1175        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1176        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1177        .dwattr $C$DW$92, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1178        .dwattr $C$DW$92, DW_AT_decl_line(0x92)
    1179        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1180$C$DW$93        .dwtag  DW_TAG_member
    1181        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$123)
    1182        .dwattr $C$DW$93, DW_AT_name("$P$T7")
    1183        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T7")
    1184        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1185        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$93, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1187        .dwattr $C$DW$93, DW_AT_decl_line(0xa0)
    1188        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1189$C$DW$94        .dwtag  DW_TAG_member
    1190        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$125)
    1191        .dwattr $C$DW$94, DW_AT_name("$P$T8")
    1192        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T8")
    1193        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1194        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1195        .dwattr $C$DW$94, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1196        .dwattr $C$DW$94, DW_AT_decl_line(0xaf)
    1197        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
    1198$C$DW$95        .dwtag  DW_TAG_member
    1199        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$32)
    1200        .dwattr $C$DW$95, DW_AT_name("rsvd24")
    1201        .dwattr $C$DW$95, DW_AT_TI_symbol_name("rsvd24")
    1202        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1203        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1204        .dwattr $C$DW$95, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1205        .dwattr $C$DW$95, DW_AT_decl_line(0xbc)
    1206        .dwattr $C$DW$95, DW_AT_decl_column(0x0b)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   23

    1207$C$DW$96        .dwtag  DW_TAG_member
    1208        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$127)
    1209        .dwattr $C$DW$96, DW_AT_name("$P$T9")
    1210        .dwattr $C$DW$96, DW_AT_TI_symbol_name("$P$T9")
    1211        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1212        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1213        .dwattr $C$DW$96, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1214        .dwattr $C$DW$96, DW_AT_decl_line(0xc0)
    1215        .dwattr $C$DW$96, DW_AT_decl_column(0x02)
    1216$C$DW$97        .dwtag  DW_TAG_member
    1217        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$33)
    1218        .dwattr $C$DW$97, DW_AT_name("rsvd2c")
    1219        .dwattr $C$DW$97, DW_AT_TI_symbol_name("rsvd2c")
    1220        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1221        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1222        .dwattr $C$DW$97, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1223        .dwattr $C$DW$97, DW_AT_decl_line(0xcb)
    1224        .dwattr $C$DW$97, DW_AT_decl_column(0x0b)
    1225$C$DW$98        .dwtag  DW_TAG_member
    1226        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$129)
    1227        .dwattr $C$DW$98, DW_AT_name("$P$T10")
    1228        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T10")
    1229        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1230        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1231        .dwattr $C$DW$98, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1232        .dwattr $C$DW$98, DW_AT_decl_line(0xcf)
    1233        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1234$C$DW$99        .dwtag  DW_TAG_member
    1235        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$131)
    1236        .dwattr $C$DW$99, DW_AT_name("$P$T11")
    1237        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T11")
    1238        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1239        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1240        .dwattr $C$DW$99, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1241        .dwattr $C$DW$99, DW_AT_decl_line(0xda)
    1242        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1243$C$DW$100       .dwtag  DW_TAG_member
    1244        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$34)
    1245        .dwattr $C$DW$100, DW_AT_name("rsvd38")
    1246        .dwattr $C$DW$100, DW_AT_TI_symbol_name("rsvd38")
    1247        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1248        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1249        .dwattr $C$DW$100, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1250        .dwattr $C$DW$100, DW_AT_decl_line(0xe5)
    1251        .dwattr $C$DW$100, DW_AT_decl_column(0x0b)
    1252$C$DW$101       .dwtag  DW_TAG_member
    1253        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$133)
    1254        .dwattr $C$DW$101, DW_AT_name("$P$T12")
    1255        .dwattr $C$DW$101, DW_AT_TI_symbol_name("$P$T12")
    1256        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1257        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1258        .dwattr $C$DW$101, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1259        .dwattr $C$DW$101, DW_AT_decl_line(0xe8)
    1260        .dwattr $C$DW$101, DW_AT_decl_column(0x02)
    1261        .dwendtag $C$DW$T$35
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   24

    1262
    1263        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1264        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1265        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1266$C$DW$T$263     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1267        .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$35)
    1268        .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    1269        .dwattr $C$DW$T$263, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_bui
    1270        .dwattr $C$DW$T$263, DW_AT_decl_line(0xf0)
    1271        .dwattr $C$DW$T$263, DW_AT_decl_column(0x03)
    1272$C$DW$T$264     .dwtag  DW_TAG_volatile_type
    1273        .dwattr $C$DW$T$264, DW_AT_type(*$C$DW$T$263)
    1274
    1275$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1276        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1277$C$DW$102       .dwtag  DW_TAG_member
    1278        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1279        .dwattr $C$DW$102, DW_AT_name("REV_MINOR")
    1280        .dwattr $C$DW$102, DW_AT_TI_symbol_name("REV_MINOR")
    1281        .dwattr $C$DW$102, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1282        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1284        .dwattr $C$DW$102, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1285        .dwattr $C$DW$102, DW_AT_decl_line(0x2d)
    1286        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1287$C$DW$103       .dwtag  DW_TAG_member
    1288        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1289        .dwattr $C$DW$103, DW_AT_name("REV_CUSTOM")
    1290        .dwattr $C$DW$103, DW_AT_TI_symbol_name("REV_CUSTOM")
    1291        .dwattr $C$DW$103, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1292        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1294        .dwattr $C$DW$103, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1295        .dwattr $C$DW$103, DW_AT_decl_line(0x2e)
    1296        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1297$C$DW$104       .dwtag  DW_TAG_member
    1298        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1299        .dwattr $C$DW$104, DW_AT_name("REV_MAJOR")
    1300        .dwattr $C$DW$104, DW_AT_TI_symbol_name("REV_MAJOR")
    1301        .dwattr $C$DW$104, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1302        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1304        .dwattr $C$DW$104, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1305        .dwattr $C$DW$104, DW_AT_decl_line(0x2f)
    1306        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1307$C$DW$105       .dwtag  DW_TAG_member
    1308        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1309        .dwattr $C$DW$105, DW_AT_name("REV_RTL")
    1310        .dwattr $C$DW$105, DW_AT_TI_symbol_name("REV_RTL")
    1311        .dwattr $C$DW$105, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1312        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1314        .dwattr $C$DW$105, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1315        .dwattr $C$DW$105, DW_AT_decl_line(0x30)
    1316        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   25

    1317$C$DW$106       .dwtag  DW_TAG_member
    1318        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1319        .dwattr $C$DW$106, DW_AT_name("REV_MODULE")
    1320        .dwattr $C$DW$106, DW_AT_TI_symbol_name("REV_MODULE")
    1321        .dwattr $C$DW$106, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1322        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1324        .dwattr $C$DW$106, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1325        .dwattr $C$DW$106, DW_AT_decl_line(0x31)
    1326        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1327$C$DW$107       .dwtag  DW_TAG_member
    1328        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1329        .dwattr $C$DW$107, DW_AT_name("rsvd28")
    1330        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd28")
    1331        .dwattr $C$DW$107, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1332        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1334        .dwattr $C$DW$107, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1335        .dwattr $C$DW$107, DW_AT_decl_line(0x32)
    1336        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1337$C$DW$108       .dwtag  DW_TAG_member
    1338        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1339        .dwattr $C$DW$108, DW_AT_name("REV_SCHEME")
    1340        .dwattr $C$DW$108, DW_AT_TI_symbol_name("REV_SCHEME")
    1341        .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1342        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1344        .dwattr $C$DW$108, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1345        .dwattr $C$DW$108, DW_AT_decl_line(0x33)
    1346        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1347        .dwendtag $C$DW$T$36
    1348
    1349        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1350        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1351        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1352$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    1353        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$36)
    1354
    1355$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1356        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1357$C$DW$109       .dwtag  DW_TAG_member
    1358        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1359        .dwattr $C$DW$109, DW_AT_name("rsvd0")
    1360        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd0")
    1361        .dwattr $C$DW$109, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1362        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1364        .dwattr $C$DW$109, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1365        .dwattr $C$DW$109, DW_AT_decl_line(0x3d)
    1366        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1367$C$DW$110       .dwtag  DW_TAG_member
    1368        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1369        .dwattr $C$DW$110, DW_AT_name("NEST_MODE")
    1370        .dwattr $C$DW$110, DW_AT_TI_symbol_name("NEST_MODE")
    1371        .dwattr $C$DW$110, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   26

    1372        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1374        .dwattr $C$DW$110, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1375        .dwattr $C$DW$110, DW_AT_decl_line(0x3e)
    1376        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1377$C$DW$111       .dwtag  DW_TAG_member
    1378        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1379        .dwattr $C$DW$111, DW_AT_name("rsvd4")
    1380        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd4")
    1381        .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1382        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1384        .dwattr $C$DW$111, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1385        .dwattr $C$DW$111, DW_AT_decl_line(0x3f)
    1386        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1387        .dwendtag $C$DW$T$37
    1388
    1389        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1390        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    1391        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1392$C$DW$T$136     .dwtag  DW_TAG_volatile_type
    1393        .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$37)
    1394
    1395$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1396        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1397$C$DW$112       .dwtag  DW_TAG_member
    1398        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1399        .dwattr $C$DW$112, DW_AT_name("EN_HINT_ANY")
    1400        .dwattr $C$DW$112, DW_AT_TI_symbol_name("EN_HINT_ANY")
    1401        .dwattr $C$DW$112, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1402        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1404        .dwattr $C$DW$112, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1405        .dwattr $C$DW$112, DW_AT_decl_line(0x4c)
    1406        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1407$C$DW$113       .dwtag  DW_TAG_member
    1408        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1409        .dwattr $C$DW$113, DW_AT_name("rsvd1")
    1410        .dwattr $C$DW$113, DW_AT_TI_symbol_name("rsvd1")
    1411        .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1412        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1414        .dwattr $C$DW$113, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1415        .dwattr $C$DW$113, DW_AT_decl_line(0x4d)
    1416        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1417        .dwendtag $C$DW$T$38
    1418
    1419        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1420        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    1421        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1422$C$DW$T$138     .dwtag  DW_TAG_volatile_type
    1423        .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
    1424
    1425$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1426        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   27

    1427$C$DW$114       .dwtag  DW_TAG_member
    1428        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1429        .dwattr $C$DW$114, DW_AT_name("GLB_NEST_LEVEL")
    1430        .dwattr $C$DW$114, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    1431        .dwattr $C$DW$114, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    1432        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1434        .dwattr $C$DW$114, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1435        .dwattr $C$DW$114, DW_AT_decl_line(0x5a)
    1436        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1437$C$DW$115       .dwtag  DW_TAG_member
    1438        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1439        .dwattr $C$DW$115, DW_AT_name("rsvd9")
    1440        .dwattr $C$DW$115, DW_AT_TI_symbol_name("rsvd9")
    1441        .dwattr $C$DW$115, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    1442        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1444        .dwattr $C$DW$115, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1445        .dwattr $C$DW$115, DW_AT_decl_line(0x5b)
    1446        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1447$C$DW$116       .dwtag  DW_TAG_member
    1448        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1449        .dwattr $C$DW$116, DW_AT_name("AUTO_OVERRIDE")
    1450        .dwattr $C$DW$116, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    1451        .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1452        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1454        .dwattr $C$DW$116, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1455        .dwattr $C$DW$116, DW_AT_decl_line(0x5c)
    1456        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1457        .dwendtag $C$DW$T$39
    1458
    1459        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1460        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    1461        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1462$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    1463        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    1464
    1465$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1466        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1467$C$DW$117       .dwtag  DW_TAG_member
    1468        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1469        .dwattr $C$DW$117, DW_AT_name("STS_SET_IDX")
    1470        .dwattr $C$DW$117, DW_AT_TI_symbol_name("STS_SET_IDX")
    1471        .dwattr $C$DW$117, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1472        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1474        .dwattr $C$DW$117, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1475        .dwattr $C$DW$117, DW_AT_decl_line(0x66)
    1476        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1477$C$DW$118       .dwtag  DW_TAG_member
    1478        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1479        .dwattr $C$DW$118, DW_AT_name("rsvd10")
    1480        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd10")
    1481        .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
button_led1.asm                                                      PAGE   28

    1482        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1484        .dwattr $C$DW$118, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1485        .dwattr $C$DW$118, DW_AT_decl_line(0x67)
    1486        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1487        .dwendtag $C$DW$T$40
    1488
    1489        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1490        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    1491        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1492$C$DW$T$142     .dwtag  DW_TAG_volatile_type
    1493        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$40)
    1494
    1495$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1496        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1497$C$DW$119       .dwtag  DW_TAG_member
    1498        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1499        .dwattr $C$DW$119, DW_AT_name("STS_CLR_IDX")
    1500        .dwattr $C$DW$119, DW_AT_TI_symbol_name("STS_CLR_IDX")
    1501        .dwattr $C$DW$119, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1502        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1504        .dwattr $C$DW$119, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1505        .dwattr $C$DW$119, DW_AT_decl_line(0x71)
    1506        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1507$C$DW$120       .dwtag  DW_TAG_member
    1508        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1509        .dwattr $C$DW$120, DW_AT_name("rsvd10")
    1510        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd10")
    1511        .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1512        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1514        .dwattr $C$DW$120, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1515        .dwattr $C$DW$120, DW_AT_decl_line(0x72)
    1516        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1517        .dwendtag $C$DW$T$41
    1518
    1519        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1520        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    1521        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1522$C$DW$T$144     .dwtag  DW_TAG_volatile_type
    1523        .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$41)
    1524
    1525$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1526        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1527$C$DW$121       .dwtag  DW_TAG_member
    1528        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1529        .dwattr $C$DW$121, DW_AT_name("EN_SET_IDX")
    1530        .dwattr $C$DW$121, DW_AT_TI_symbol_name("EN_SET_IDX")
    1531        .dwattr $C$DW$121, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
