PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Tue Jul  2 18:45:23 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("PRU_experiment_CAN.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/arturs/AE_Custom_Linux_kernels_Yocto/AE_PRU_experiment
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .global __PRU_CREG_DCAN0
      15        .global __PRU_CREG_PRU_SHAREDMEM
      16        .global __PRU_CREG_PRU_SHAREDMEM
      17        .global __PRU_CREG_PRU_SHAREDMEM
      18
      19$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      20        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")

     725 00000024 000000E1042081          SBBO      &r1, r0, 4, 4         ; [ALU_PRU] |174| $O$C1
     726        .dwpsn  file "PRU_experiment_CAN.c",line 185,column 2,is_stmt,isa 0
     727;----------------------------------------------------------------------
     728; 185 | ptr_cm[CM_PER_DCAN0_CLKCTRL] = ON;                                     
     729;----------------------------------------------------------------------
     730 00000028 00000024000201          LDI       r1.b0, 0x02           ; [ALU_PRU] |185| 
     731        .dwpsn  file "PRU_experiment_CAN.c",line 177,column 2,is_stmt,isa 0
     732 0000002c 000000F1302080          LBBO      &r0, r0, 48, 4        ; [ALU_PRU] |177| $O$C1
     733        .dwpsn  file "PRU_experiment_CAN.c",line 185,column 2,is_stmt,isa 0
     734 00000030 00C0802444E0C0          LDI32     r0, 0x44e000c0        ; [ALU_PRU] |185| 
         00000037 00000000004024 
     735 00000038 000000E1000001          SBBO      &r1.b0, r0, 0, 1      ; [ALU_PRU] |185| 
     736        .dwpsn  file "PRU_experiment_CAN.c",line 190,column 2,is_stmt,isa 0
     737;----------------------------------------------------------------------
     738; 190 | setUpCANTimings();                                                     
     739;----------------------------------------------------------------------
     740$C$DW$26        .dwtag  DW_TAG_TI_branch
     741        .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     742        .dwattr $C$DW$26, DW_AT_name("setUpCANTimings")
     743        .dwattr $C$DW$26, DW_AT_TI_call
     744 0000003c 000000230000C3!         JAL       r3.w2, ||setUpCANTimings|| ; [ALU_PRU] |190| setUpCANTimings
     745        .dwpsn  file "PRU_experiment_CAN.c",line 195,column 2,is_stmt,isa 0
     746;----------------------------------------------------------------------
     747; 195 | configureCANObjects();                                                 
     748; 202 | PRU0_CTRL.CTPPR0_bit.C28_BLK_POINTER = 0x0100;                         
     749; 205 | shared_freq_1 = 1;                                                     
     750; 208 | if (shared_freq_1 == 1)                                                
     751; 209 |         shared_freq_2 = shared_freq_2 + 1;                             
     752; 210 | else                                                                   
     753; 211 |         shared_freq_2 = shared_freq_3;                                 
     754; 215 | while (1) {                                                            
     755; 216 |         //setUpCANTimings();                                           
     756; 217 |         //configureCANObjects();                                       
     757; 219 |         __delay_cycles(100000000); //# 500ms wait                      
     758; 221 |         transmitDataFrame();                                           
     759; 223 |         pokePRU1Processor();                                           
     760; 225 |         __delay_cycles(100000000); //# 500ms wait                      
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   15

     761; 227 |         //tmp_val = IF2CMD;                                            
     762; 228 |         //IF2CMD = tmp_val | 0x840000; //# Setting IF2CMD[23] = WR_RD =
     763;     |  1 and IF2CMD[18] = TxRqst_NewDat = 1 to start a data frame transmissio
     764;     | n                                                                      
     765; 229 |         //tmp_val = IF2CMD;                                            
     766; 230 |         //IF2CMD = tmp_val | 0x1; //# Setting IF2CMD[7:0] = message_num
     767;     | ber to start data transfer from IF register to RAM, which will         
     768; 231 |                                                         //# also set th
     769;     | e TxRqst flag and actually start the data frame transmission           
     770; 232 |         //while (IF2CMD & 0x8000 > 0); //# waiting until the IF1 regist
     771;     | ers are transmitted to DCAN RAM, which will start CAN data frame transm
     772;     | ission                                                                 
     773; 236 | __halt();                                                              
     774;----------------------------------------------------------------------
     775$C$DW$27        .dwtag  DW_TAG_TI_branch
     776        .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     777        .dwattr $C$DW$27, DW_AT_name("configureCANObjects")
     778        .dwattr $C$DW$27, DW_AT_TI_call
     779 00000040 000000230000C3!         JAL       r3.w2, ||configureCANObjects|| ; [ALU_PRU] |195| configureCANObjects
     780$C$DW$28        .dwtag  DW_TAG_TI_branch
     781        .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     782        .dwattr $C$DW$28, DW_AT_TI_return
     783 00000044 00000020830000          JMP       r3.w0                 ; [ALU_PRU] 
     784        .dwattr $C$DW$23, DW_AT_TI_end_file("PRU_experiment_CAN.c")
     785        .dwattr $C$DW$23, DW_AT_TI_end_line(0xed)
     786        .dwattr $C$DW$23, DW_AT_TI_end_column(0x01)
     787        .dwendentry
     788        .dwendtag $C$DW$23
     789
     790
     791;******************************************************************************
     792;* TYPE INFORMATION                                                           *
     793;******************************************************************************
     794
     795$C$DW$T$19      .dwtag  DW_TAG_structure_type
     796        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     797$C$DW$29        .dwtag  DW_TAG_member
     798        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     799        .dwattr $C$DW$29, DW_AT_name("REVID")
     800        .dwattr $C$DW$29, DW_AT_TI_symbol_name("REVID")
     801        .dwattr $C$DW$29, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     802        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     804        .dwattr $C$DW$29, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     805        .dwattr $C$DW$29, DW_AT_decl_line(0x2d)
     806        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     807        .dwendtag $C$DW$T$19
     808
     809        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     810        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     811        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     812$C$DW$T$119     .dwtag  DW_TAG_volatile_type
     813        .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$19)
     814
     815$C$DW$T$20      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   16

     816        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     817$C$DW$30        .dwtag  DW_TAG_member
     818        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     819        .dwattr $C$DW$30, DW_AT_name("IDLE_MODE")
     820        .dwattr $C$DW$30, DW_AT_TI_symbol_name("IDLE_MODE")
     821        .dwattr $C$DW$30, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     822        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     824        .dwattr $C$DW$30, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     825        .dwattr $C$DW$30, DW_AT_decl_line(0x37)
     826        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     827$C$DW$31        .dwtag  DW_TAG_member
     828        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     829        .dwattr $C$DW$31, DW_AT_name("STANDBY_MODE")
     830        .dwattr $C$DW$31, DW_AT_TI_symbol_name("STANDBY_MODE")
     831        .dwattr $C$DW$31, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     832        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     834        .dwattr $C$DW$31, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     835        .dwattr $C$DW$31, DW_AT_decl_line(0x38)
     836        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     837$C$DW$32        .dwtag  DW_TAG_member
     838        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     839        .dwattr $C$DW$32, DW_AT_name("STANDBY_INIT")
     840        .dwattr $C$DW$32, DW_AT_TI_symbol_name("STANDBY_INIT")
     841        .dwattr $C$DW$32, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     842        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     844        .dwattr $C$DW$32, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     845        .dwattr $C$DW$32, DW_AT_decl_line(0x39)
     846        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     847$C$DW$33        .dwtag  DW_TAG_member
     848        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     849        .dwattr $C$DW$33, DW_AT_name("SUB_MWAIT")
     850        .dwattr $C$DW$33, DW_AT_TI_symbol_name("SUB_MWAIT")
     851        .dwattr $C$DW$33, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     852        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     854        .dwattr $C$DW$33, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     855        .dwattr $C$DW$33, DW_AT_decl_line(0x3a)
     856        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     857$C$DW$34        .dwtag  DW_TAG_member
     858        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     859        .dwattr $C$DW$34, DW_AT_name("rsvd6")
     860        .dwattr $C$DW$34, DW_AT_TI_symbol_name("rsvd6")
     861        .dwattr $C$DW$34, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     862        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     864        .dwattr $C$DW$34, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     865        .dwattr $C$DW$34, DW_AT_decl_line(0x3b)
     866        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     867        .dwendtag $C$DW$T$20
     868
     869        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     870        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   17

     871        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     872$C$DW$T$121     .dwtag  DW_TAG_volatile_type
     873        .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$20)
     874
     875$C$DW$T$21      .dwtag  DW_TAG_structure_type
     876        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     877$C$DW$35        .dwtag  DW_TAG_member
     878        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     879        .dwattr $C$DW$35, DW_AT_name("PRU0_GPI_MODE")
     880        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     881        .dwattr $C$DW$35, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     882        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     884        .dwattr $C$DW$35, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     885        .dwattr $C$DW$35, DW_AT_decl_line(0x45)
     886        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     887$C$DW$36        .dwtag  DW_TAG_member
     888        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     889        .dwattr $C$DW$36, DW_AT_name("PRU0_GPI_CLK_MODE")
     890        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     891        .dwattr $C$DW$36, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     892        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     894        .dwattr $C$DW$36, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     895        .dwattr $C$DW$36, DW_AT_decl_line(0x46)
     896        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     897$C$DW$37        .dwtag  DW_TAG_member
     898        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     899        .dwattr $C$DW$37, DW_AT_name("PRU0_GPI_DIV0")
     900        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     901        .dwattr $C$DW$37, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     902        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     904        .dwattr $C$DW$37, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     905        .dwattr $C$DW$37, DW_AT_decl_line(0x47)
     906        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     907$C$DW$38        .dwtag  DW_TAG_member
     908        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     909        .dwattr $C$DW$38, DW_AT_name("PRU0_GPI_DIV1")
     910        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     911        .dwattr $C$DW$38, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     912        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     914        .dwattr $C$DW$38, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     915        .dwattr $C$DW$38, DW_AT_decl_line(0x48)
     916        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     917$C$DW$39        .dwtag  DW_TAG_member
     918        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     919        .dwattr $C$DW$39, DW_AT_name("PRU0_GPI_SB")
     920        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     921        .dwattr $C$DW$39, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     922        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     924        .dwattr $C$DW$39, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     925        .dwattr $C$DW$39, DW_AT_decl_line(0x49)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   18

     926        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     927$C$DW$40        .dwtag  DW_TAG_member
     928        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     929        .dwattr $C$DW$40, DW_AT_name("PRU0_GPO_MODE")
     930        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     931        .dwattr $C$DW$40, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     932        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     934        .dwattr $C$DW$40, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     935        .dwattr $C$DW$40, DW_AT_decl_line(0x4a)
     936        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     937$C$DW$41        .dwtag  DW_TAG_member
     938        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     939        .dwattr $C$DW$41, DW_AT_name("PRU0_GPO_DIV0")
     940        .dwattr $C$DW$41, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     941        .dwattr $C$DW$41, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     942        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     944        .dwattr $C$DW$41, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     945        .dwattr $C$DW$41, DW_AT_decl_line(0x4b)
     946        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     947$C$DW$42        .dwtag  DW_TAG_member
     948        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     949        .dwattr $C$DW$42, DW_AT_name("PRU0_GPO_DIV1")
     950        .dwattr $C$DW$42, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     951        .dwattr $C$DW$42, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     952        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     954        .dwattr $C$DW$42, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     955        .dwattr $C$DW$42, DW_AT_decl_line(0x4c)
     956        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     957$C$DW$43        .dwtag  DW_TAG_member
     958        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     959        .dwattr $C$DW$43, DW_AT_name("PRU0_GPO_SH_SEL")
     960        .dwattr $C$DW$43, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     961        .dwattr $C$DW$43, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     962        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     964        .dwattr $C$DW$43, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     965        .dwattr $C$DW$43, DW_AT_decl_line(0x4d)
     966        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     967$C$DW$44        .dwtag  DW_TAG_member
     968        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     969        .dwattr $C$DW$44, DW_AT_name("rsvd26")
     970        .dwattr $C$DW$44, DW_AT_TI_symbol_name("rsvd26")
     971        .dwattr $C$DW$44, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     972        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     974        .dwattr $C$DW$44, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     975        .dwattr $C$DW$44, DW_AT_decl_line(0x4e)
     976        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     977        .dwendtag $C$DW$T$21
     978
     979        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     980        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   19

     981        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     982$C$DW$T$123     .dwtag  DW_TAG_volatile_type
     983        .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$21)
     984
     985$C$DW$T$22      .dwtag  DW_TAG_structure_type
     986        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     987$C$DW$45        .dwtag  DW_TAG_member
     988        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     989        .dwattr $C$DW$45, DW_AT_name("PRU1_GPI_MODE")
     990        .dwattr $C$DW$45, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     991        .dwattr $C$DW$45, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     992        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     994        .dwattr $C$DW$45, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     995        .dwattr $C$DW$45, DW_AT_decl_line(0x58)
     996        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     997$C$DW$46        .dwtag  DW_TAG_member
     998        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     999        .dwattr $C$DW$46, DW_AT_name("PRU1_GPI_CLK_MODE")
    1000        .dwattr $C$DW$46, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1001        .dwattr $C$DW$46, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1002        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1004        .dwattr $C$DW$46, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1005        .dwattr $C$DW$46, DW_AT_decl_line(0x59)
    1006        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
    1007$C$DW$47        .dwtag  DW_TAG_member
    1008        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
    1009        .dwattr $C$DW$47, DW_AT_name("PRU1_GPI_DIV0")
    1010        .dwattr $C$DW$47, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1011        .dwattr $C$DW$47, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1012        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1014        .dwattr $C$DW$47, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1015        .dwattr $C$DW$47, DW_AT_decl_line(0x5a)
    1016        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
    1017$C$DW$48        .dwtag  DW_TAG_member
    1018        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
    1019        .dwattr $C$DW$48, DW_AT_name("PRU1_GPI_DIV1")
    1020        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1021        .dwattr $C$DW$48, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1022        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1024        .dwattr $C$DW$48, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1025        .dwattr $C$DW$48, DW_AT_decl_line(0x5b)
    1026        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
    1027$C$DW$49        .dwtag  DW_TAG_member
    1028        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
    1029        .dwattr $C$DW$49, DW_AT_name("PRU1_GPI_SB")
    1030        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1031        .dwattr $C$DW$49, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1032        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1034        .dwattr $C$DW$49, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1035        .dwattr $C$DW$49, DW_AT_decl_line(0x5c)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   20

    1036        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
    1037$C$DW$50        .dwtag  DW_TAG_member
    1038        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
    1039        .dwattr $C$DW$50, DW_AT_name("PRU1_GPO_MODE")
    1040        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1041        .dwattr $C$DW$50, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1042        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1044        .dwattr $C$DW$50, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1045        .dwattr $C$DW$50, DW_AT_decl_line(0x5d)
    1046        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
    1047$C$DW$51        .dwtag  DW_TAG_member
    1048        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
    1049        .dwattr $C$DW$51, DW_AT_name("PRU1_GPO_DIV0")
    1050        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1051        .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1052        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1054        .dwattr $C$DW$51, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1055        .dwattr $C$DW$51, DW_AT_decl_line(0x5e)
    1056        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
    1057$C$DW$52        .dwtag  DW_TAG_member
    1058        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
    1059        .dwattr $C$DW$52, DW_AT_name("PRU1_GPO_DIV1")
    1060        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1061        .dwattr $C$DW$52, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1062        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1064        .dwattr $C$DW$52, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1065        .dwattr $C$DW$52, DW_AT_decl_line(0x5f)
    1066        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1067$C$DW$53        .dwtag  DW_TAG_member
    1068        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
    1069        .dwattr $C$DW$53, DW_AT_name("PRU1_GPO_SH_SEL")
    1070        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1071        .dwattr $C$DW$53, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1072        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1074        .dwattr $C$DW$53, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1075        .dwattr $C$DW$53, DW_AT_decl_line(0x60)
    1076        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
    1077$C$DW$54        .dwtag  DW_TAG_member
    1078        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
    1079        .dwattr $C$DW$54, DW_AT_name("rsvd26")
    1080        .dwattr $C$DW$54, DW_AT_TI_symbol_name("rsvd26")
    1081        .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1082        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1084        .dwattr $C$DW$54, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1085        .dwattr $C$DW$54, DW_AT_decl_line(0x61)
    1086        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
    1087        .dwendtag $C$DW$T$22
    1088
    1089        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1090        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   21

    1091        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1092$C$DW$T$125     .dwtag  DW_TAG_volatile_type
    1093        .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$22)
    1094
    1095$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1096        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1097$C$DW$55        .dwtag  DW_TAG_member
    1098        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
    1099        .dwattr $C$DW$55, DW_AT_name("PRU0_CLK_STOP_REQ")
    1100        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1101        .dwattr $C$DW$55, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1102        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1104        .dwattr $C$DW$55, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1105        .dwattr $C$DW$55, DW_AT_decl_line(0x6b)
    1106        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1107$C$DW$56        .dwtag  DW_TAG_member
    1108        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
    1109        .dwattr $C$DW$56, DW_AT_name("PRU0_CLK_STOP_ACK")
    1110        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1111        .dwattr $C$DW$56, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1112        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1114        .dwattr $C$DW$56, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1115        .dwattr $C$DW$56, DW_AT_decl_line(0x6c)
    1116        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1117$C$DW$57        .dwtag  DW_TAG_member
    1118        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1119        .dwattr $C$DW$57, DW_AT_name("PRU0_CLK_EN")
    1120        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1121        .dwattr $C$DW$57, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1122        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1124        .dwattr $C$DW$57, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1125        .dwattr $C$DW$57, DW_AT_decl_line(0x6d)
    1126        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1127$C$DW$58        .dwtag  DW_TAG_member
    1128        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1129        .dwattr $C$DW$58, DW_AT_name("PRU1_CLK_STOP_REQ")
    1130        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1131        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1132        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1134        .dwattr $C$DW$58, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1135        .dwattr $C$DW$58, DW_AT_decl_line(0x6e)
    1136        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1137$C$DW$59        .dwtag  DW_TAG_member
    1138        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1139        .dwattr $C$DW$59, DW_AT_name("PRU1_CLK_STOP_ACK")
    1140        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1141        .dwattr $C$DW$59, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1142        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1144        .dwattr $C$DW$59, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1145        .dwattr $C$DW$59, DW_AT_decl_line(0x6f)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   22

    1146        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1147$C$DW$60        .dwtag  DW_TAG_member
    1148        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1149        .dwattr $C$DW$60, DW_AT_name("PRU1_CLK_EN")
    1150        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1151        .dwattr $C$DW$60, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1152        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1154        .dwattr $C$DW$60, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1155        .dwattr $C$DW$60, DW_AT_decl_line(0x70)
    1156        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1157$C$DW$61        .dwtag  DW_TAG_member
    1158        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1159        .dwattr $C$DW$61, DW_AT_name("INTC_CLK_STOP_REQ")
    1160        .dwattr $C$DW$61, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1161        .dwattr $C$DW$61, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1162        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1163        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1164        .dwattr $C$DW$61, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1165        .dwattr $C$DW$61, DW_AT_decl_line(0x71)
    1166        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1167$C$DW$62        .dwtag  DW_TAG_member
    1168        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1169        .dwattr $C$DW$62, DW_AT_name("INTC_CLK_STOP_ACK")
    1170        .dwattr $C$DW$62, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1171        .dwattr $C$DW$62, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1172        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1174        .dwattr $C$DW$62, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1175        .dwattr $C$DW$62, DW_AT_decl_line(0x72)
    1176        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1177$C$DW$63        .dwtag  DW_TAG_member
    1178        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1179        .dwattr $C$DW$63, DW_AT_name("INTC_CLK_EN")
    1180        .dwattr $C$DW$63, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1181        .dwattr $C$DW$63, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1182        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1184        .dwattr $C$DW$63, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1185        .dwattr $C$DW$63, DW_AT_decl_line(0x73)
    1186        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1187$C$DW$64        .dwtag  DW_TAG_member
    1188        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1189        .dwattr $C$DW$64, DW_AT_name("UART_CLK_STOP_REQ")
    1190        .dwattr $C$DW$64, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1191        .dwattr $C$DW$64, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1192        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1194        .dwattr $C$DW$64, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1195        .dwattr $C$DW$64, DW_AT_decl_line(0x74)
    1196        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1197$C$DW$65        .dwtag  DW_TAG_member
    1198        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1199        .dwattr $C$DW$65, DW_AT_name("UART_CLK_STOP_ACK")
    1200        .dwattr $C$DW$65, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   23

    1201        .dwattr $C$DW$65, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1202        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1204        .dwattr $C$DW$65, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1205        .dwattr $C$DW$65, DW_AT_decl_line(0x75)
    1206        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1207$C$DW$66        .dwtag  DW_TAG_member
    1208        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1209        .dwattr $C$DW$66, DW_AT_name("UART_CLK_EN")
    1210        .dwattr $C$DW$66, DW_AT_TI_symbol_name("UART_CLK_EN")
    1211        .dwattr $C$DW$66, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1212        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1214        .dwattr $C$DW$66, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1215        .dwattr $C$DW$66, DW_AT_decl_line(0x76)
    1216        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1217$C$DW$67        .dwtag  DW_TAG_member
    1218        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1219        .dwattr $C$DW$67, DW_AT_name("ECAP_CLK_STOP_REQ")
    1220        .dwattr $C$DW$67, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1221        .dwattr $C$DW$67, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1222        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1224        .dwattr $C$DW$67, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1225        .dwattr $C$DW$67, DW_AT_decl_line(0x77)
    1226        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1227$C$DW$68        .dwtag  DW_TAG_member
    1228        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1229        .dwattr $C$DW$68, DW_AT_name("ECAP_CLK_STOP_ACK")
    1230        .dwattr $C$DW$68, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1231        .dwattr $C$DW$68, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1232        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1234        .dwattr $C$DW$68, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1235        .dwattr $C$DW$68, DW_AT_decl_line(0x78)
    1236        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1237$C$DW$69        .dwtag  DW_TAG_member
    1238        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1239        .dwattr $C$DW$69, DW_AT_name("ECAP_CLK_EN")
    1240        .dwattr $C$DW$69, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1241        .dwattr $C$DW$69, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1242        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1244        .dwattr $C$DW$69, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1245        .dwattr $C$DW$69, DW_AT_decl_line(0x79)
    1246        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1247$C$DW$70        .dwtag  DW_TAG_member
    1248        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1249        .dwattr $C$DW$70, DW_AT_name("IEP_CLK_STOP_REQ")
    1250        .dwattr $C$DW$70, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1251        .dwattr $C$DW$70, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1252        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1254        .dwattr $C$DW$70, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1255        .dwattr $C$DW$70, DW_AT_decl_line(0x7a)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   24

    1256        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1257$C$DW$71        .dwtag  DW_TAG_member
    1258        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1259        .dwattr $C$DW$71, DW_AT_name("IEP_CLK_STOP_ACK")
    1260        .dwattr $C$DW$71, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1261        .dwattr $C$DW$71, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1262        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1264        .dwattr $C$DW$71, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1265        .dwattr $C$DW$71, DW_AT_decl_line(0x7b)
    1266        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1267$C$DW$72        .dwtag  DW_TAG_member
    1268        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1269        .dwattr $C$DW$72, DW_AT_name("IEP_CLK_EN")
    1270        .dwattr $C$DW$72, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1271        .dwattr $C$DW$72, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1272        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1274        .dwattr $C$DW$72, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1275        .dwattr $C$DW$72, DW_AT_decl_line(0x7c)
    1276        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1277$C$DW$73        .dwtag  DW_TAG_member
    1278        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1279        .dwattr $C$DW$73, DW_AT_name("rsvd18")
    1280        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd18")
    1281        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1282        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1284        .dwattr $C$DW$73, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1285        .dwattr $C$DW$73, DW_AT_decl_line(0x7d)
    1286        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1287        .dwendtag $C$DW$T$23
    1288
    1289        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1290        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1291        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1292$C$DW$T$127     .dwtag  DW_TAG_volatile_type
    1293        .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$23)
    1294
    1295$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1296        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1297$C$DW$74        .dwtag  DW_TAG_member
    1298        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1299        .dwattr $C$DW$74, DW_AT_name("PRU0_IMEM_PE_RAW")
    1300        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1301        .dwattr $C$DW$74, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1302        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1304        .dwattr $C$DW$74, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1305        .dwattr $C$DW$74, DW_AT_decl_line(0x87)
    1306        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1307$C$DW$75        .dwtag  DW_TAG_member
    1308        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1309        .dwattr $C$DW$75, DW_AT_name("PRU0_DMEM_PE_RAW")
    1310        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   25

    1311        .dwattr $C$DW$75, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1312        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1314        .dwattr $C$DW$75, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1315        .dwattr $C$DW$75, DW_AT_decl_line(0x88)
    1316        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1317$C$DW$76        .dwtag  DW_TAG_member
    1318        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1319        .dwattr $C$DW$76, DW_AT_name("PRU1_IMEM_PE_RAW")
    1320        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1321        .dwattr $C$DW$76, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1322        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1324        .dwattr $C$DW$76, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1325        .dwattr $C$DW$76, DW_AT_decl_line(0x89)
    1326        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1327$C$DW$77        .dwtag  DW_TAG_member
    1328        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1329        .dwattr $C$DW$77, DW_AT_name("PRU1_DMEM_PE_RAW")
    1330        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1331        .dwattr $C$DW$77, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1332        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1334        .dwattr $C$DW$77, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1335        .dwattr $C$DW$77, DW_AT_decl_line(0x8a)
    1336        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1337$C$DW$78        .dwtag  DW_TAG_member
    1338        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1339        .dwattr $C$DW$78, DW_AT_name("RAM_PE_RAW")
    1340        .dwattr $C$DW$78, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1341        .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1342        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1344        .dwattr $C$DW$78, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1345        .dwattr $C$DW$78, DW_AT_decl_line(0x8b)
    1346        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1347$C$DW$79        .dwtag  DW_TAG_member
    1348        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1349        .dwattr $C$DW$79, DW_AT_name("rsvd20")
    1350        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd20")
    1351        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1352        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1354        .dwattr $C$DW$79, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1355        .dwattr $C$DW$79, DW_AT_decl_line(0x8c)
    1356        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1357        .dwendtag $C$DW$T$24
    1358
    1359        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1360        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1361        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1362$C$DW$T$129     .dwtag  DW_TAG_volatile_type
    1363        .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$24)
    1364
    1365$C$DW$T$25      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   26

    1366        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1367$C$DW$80        .dwtag  DW_TAG_member
    1368        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1369        .dwattr $C$DW$80, DW_AT_name("PRU0_IMEM_PE")
    1370        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1371        .dwattr $C$DW$80, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1372        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1374        .dwattr $C$DW$80, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1375        .dwattr $C$DW$80, DW_AT_decl_line(0x96)
    1376        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1377$C$DW$81        .dwtag  DW_TAG_member
    1378        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1379        .dwattr $C$DW$81, DW_AT_name("PRU0_DMEM_PE")
    1380        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1381        .dwattr $C$DW$81, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1382        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1384        .dwattr $C$DW$81, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1385        .dwattr $C$DW$81, DW_AT_decl_line(0x97)
    1386        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1387$C$DW$82        .dwtag  DW_TAG_member
    1388        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1389        .dwattr $C$DW$82, DW_AT_name("PRU1_IMEM_PE")
    1390        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1391        .dwattr $C$DW$82, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1392        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1394        .dwattr $C$DW$82, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1395        .dwattr $C$DW$82, DW_AT_decl_line(0x98)
    1396        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1397$C$DW$83        .dwtag  DW_TAG_member
    1398        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1399        .dwattr $C$DW$83, DW_AT_name("PRU1_DMEM_PE")
    1400        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1401        .dwattr $C$DW$83, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1402        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1404        .dwattr $C$DW$83, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1405        .dwattr $C$DW$83, DW_AT_decl_line(0x99)
    1406        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1407$C$DW$84        .dwtag  DW_TAG_member
    1408        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1409        .dwattr $C$DW$84, DW_AT_name("RAM_PE")
    1410        .dwattr $C$DW$84, DW_AT_TI_symbol_name("RAM_PE")
    1411        .dwattr $C$DW$84, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1412        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1414        .dwattr $C$DW$84, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1415        .dwattr $C$DW$84, DW_AT_decl_line(0x9a)
    1416        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1417$C$DW$85        .dwtag  DW_TAG_member
    1418        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1419        .dwattr $C$DW$85, DW_AT_name("rsvd20")
    1420        .dwattr $C$DW$85, DW_AT_TI_symbol_name("rsvd20")
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   27

    1421        .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1422        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1424        .dwattr $C$DW$85, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1425        .dwattr $C$DW$85, DW_AT_decl_line(0x9b)
    1426        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1427        .dwendtag $C$DW$T$25
    1428
    1429        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1430        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1431        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1432$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1433        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$25)
    1434
    1435$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1436        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1437$C$DW$86        .dwtag  DW_TAG_member
    1438        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1439        .dwattr $C$DW$86, DW_AT_name("PRU0_IMEM_PE_SET")
    1440        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1441        .dwattr $C$DW$86, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1442        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1444        .dwattr $C$DW$86, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1445        .dwattr $C$DW$86, DW_AT_decl_line(0xa4)
    1446        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1447$C$DW$87        .dwtag  DW_TAG_member
    1448        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1449        .dwattr $C$DW$87, DW_AT_name("PRU0_DMEM_PE_SET")
    1450        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1451        .dwattr $C$DW$87, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1452        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1454        .dwattr $C$DW$87, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1455        .dwattr $C$DW$87, DW_AT_decl_line(0xa5)
    1456        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1457$C$DW$88        .dwtag  DW_TAG_member
    1458        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1459        .dwattr $C$DW$88, DW_AT_name("PRU1_IMEM_PE_SET")
    1460        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1461        .dwattr $C$DW$88, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1462        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1464        .dwattr $C$DW$88, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1465        .dwattr $C$DW$88, DW_AT_decl_line(0xa6)
    1466        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1467$C$DW$89        .dwtag  DW_TAG_member
    1468        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1469        .dwattr $C$DW$89, DW_AT_name("PRU1_DMEM_PE_SET")
    1470        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1471        .dwattr $C$DW$89, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1472        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1474        .dwattr $C$DW$89, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1475        .dwattr $C$DW$89, DW_AT_decl_line(0xa7)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   28

    1476        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1477$C$DW$90        .dwtag  DW_TAG_member
    1478        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1479        .dwattr $C$DW$90, DW_AT_name("RAM_PE_SET")
    1480        .dwattr $C$DW$90, DW_AT_TI_symbol_name("RAM_PE_SET")
    1481        .dwattr $C$DW$90, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1482        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1484        .dwattr $C$DW$90, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1485        .dwattr $C$DW$90, DW_AT_decl_line(0xa8)
    1486        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1487$C$DW$91        .dwtag  DW_TAG_member
    1488        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1489        .dwattr $C$DW$91, DW_AT_name("rsvd20")
    1490        .dwattr $C$DW$91, DW_AT_TI_symbol_name("rsvd20")
    1491        .dwattr $C$DW$91, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1492        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1493        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1494        .dwattr $C$DW$91, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1495        .dwattr $C$DW$91, DW_AT_decl_line(0xa9)
    1496        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1497        .dwendtag $C$DW$T$26
    1498
    1499        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1500        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1501        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1502$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1503        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$26)
    1504
    1505$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1506        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1507$C$DW$92        .dwtag  DW_TAG_member
    1508        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1509        .dwattr $C$DW$92, DW_AT_name("PRU0_IMEM_PE_CLR")
    1510        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1511        .dwattr $C$DW$92, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1512        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1514        .dwattr $C$DW$92, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1515        .dwattr $C$DW$92, DW_AT_decl_line(0xb3)
    1516        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1517$C$DW$93        .dwtag  DW_TAG_member
    1518        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1519        .dwattr $C$DW$93, DW_AT_name("PRU0_DMEM_PE_CLR")
    1520        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1521        .dwattr $C$DW$93, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1522        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1524        .dwattr $C$DW$93, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1525        .dwattr $C$DW$93, DW_AT_decl_line(0xb4)
    1526        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1527$C$DW$94        .dwtag  DW_TAG_member
    1528        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1529        .dwattr $C$DW$94, DW_AT_name("PRU1_IMEM_PE_CLR")
    1530        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   29

    1531        .dwattr $C$DW$94, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1532        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1534        .dwattr $C$DW$94, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1535        .dwattr $C$DW$94, DW_AT_decl_line(0xb5)
    1536        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1537$C$DW$95        .dwtag  DW_TAG_member
    1538        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1539        .dwattr $C$DW$95, DW_AT_name("PRU1_DMEM_PE_CLR")
    1540        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1541        .dwattr $C$DW$95, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1542        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1544        .dwattr $C$DW$95, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1545        .dwattr $C$DW$95, DW_AT_decl_line(0xb6)
    1546        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1547$C$DW$96        .dwtag  DW_TAG_member
    1548        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1549        .dwattr $C$DW$96, DW_AT_name("rsvd16")
    1550        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd16")
    1551        .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1552        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1554        .dwattr $C$DW$96, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1555        .dwattr $C$DW$96, DW_AT_decl_line(0xb7)
    1556        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1557        .dwendtag $C$DW$T$27
    1558
    1559        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1560        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1561        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1562$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1563        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$27)
    1564
    1565$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1566        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1567$C$DW$97        .dwtag  DW_TAG_member
    1568        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1569        .dwattr $C$DW$97, DW_AT_name("PMAO_PRU0")
    1570        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PMAO_PRU0")
    1571        .dwattr $C$DW$97, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1572        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1574        .dwattr $C$DW$97, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1575        .dwattr $C$DW$97, DW_AT_decl_line(0xc4)
    1576        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1577$C$DW$98        .dwtag  DW_TAG_member
    1578        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1579        .dwattr $C$DW$98, DW_AT_name("PMAO_PRU1")
    1580        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PMAO_PRU1")
    1581        .dwattr $C$DW$98, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1582        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1583        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1584        .dwattr $C$DW$98, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1585        .dwattr $C$DW$98, DW_AT_decl_line(0xc5)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   30

    1586        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1587$C$DW$99        .dwtag  DW_TAG_member
    1588        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1589        .dwattr $C$DW$99, DW_AT_name("rsvd2")
    1590        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd2")
    1591        .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1592        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1594        .dwattr $C$DW$99, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1595        .dwattr $C$DW$99, DW_AT_decl_line(0xc6)
    1596        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1597        .dwendtag $C$DW$T$28
    1598
    1599        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1600        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1601        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1602$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1603        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$28)
    1604
    1605$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1606        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1607$C$DW$100       .dwtag  DW_TAG_member
    1608        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1609        .dwattr $C$DW$100, DW_AT_name("OCP_EN")
    1610        .dwattr $C$DW$100, DW_AT_TI_symbol_name("OCP_EN")
    1611        .dwattr $C$DW$100, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1612        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1614        .dwattr $C$DW$100, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1615        .dwattr $C$DW$100, DW_AT_decl_line(0xd3)
    1616        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1617$C$DW$101       .dwtag  DW_TAG_member
    1618        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1619        .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1620        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd1")
    1621        .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1622        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1624        .dwattr $C$DW$101, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1625        .dwattr $C$DW$101, DW_AT_decl_line(0xd4)
    1626        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1627        .dwendtag $C$DW$T$29
    1628
    1629        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1630        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1631        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1632$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1633        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$29)
    1634
    1635$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1636        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1637$C$DW$102       .dwtag  DW_TAG_member
    1638        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1639        .dwattr $C$DW$102, DW_AT_name("PRU1_PAD_HP_EN")
    1640        .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   31

    1641        .dwattr $C$DW$102, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1642        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1644        .dwattr $C$DW$102, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1645        .dwattr $C$DW$102, DW_AT_decl_line(0xde)
    1646        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1647$C$DW$103       .dwtag  DW_TAG_member
    1648        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1649        .dwattr $C$DW$103, DW_AT_name("XFR_SHIFT_EN")
    1650        .dwattr $C$DW$103, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1651        .dwattr $C$DW$103, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1652        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1654        .dwattr $C$DW$103, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1655        .dwattr $C$DW$103, DW_AT_decl_line(0xdf)
    1656        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1657$C$DW$104       .dwtag  DW_TAG_member
    1658        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1659        .dwattr $C$DW$104, DW_AT_name("rsvd2")
    1660        .dwattr $C$DW$104, DW_AT_TI_symbol_name("rsvd2")
    1661        .dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1662        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1664        .dwattr $C$DW$104, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1665        .dwattr $C$DW$104, DW_AT_decl_line(0xe0)
    1666        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1667        .dwendtag $C$DW$T$30
    1668
    1669        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1670        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1671        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1672$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    1673        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$30)
    1674
    1675$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1676        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1677$C$DW$105       .dwtag  DW_TAG_member
    1678        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1679        .dwattr $C$DW$105, DW_AT_name("PIN_MUX_SEL")
    1680        .dwattr $C$DW$105, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1681        .dwattr $C$DW$105, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1682        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1684        .dwattr $C$DW$105, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1685        .dwattr $C$DW$105, DW_AT_decl_line(0xec)
    1686        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1687$C$DW$106       .dwtag  DW_TAG_member
    1688        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1689        .dwattr $C$DW$106, DW_AT_name("rsvd2")
    1690        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd2")
    1691        .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1692        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1694        .dwattr $C$DW$106, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1695        .dwattr $C$DW$106, DW_AT_decl_line(0xed)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   32

    1696        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1697        .dwendtag $C$DW$T$31
    1698
    1699        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1700        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1701        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1702$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1703        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$31)
    1704
    1705$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1706        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1707$C$DW$107       .dwtag  DW_TAG_member
    1708        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$120)
    1709        .dwattr $C$DW$107, DW_AT_name("$P$T0")
    1710        .dwattr $C$DW$107, DW_AT_TI_symbol_name("$P$T0")
    1711        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1713        .dwattr $C$DW$107, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1714        .dwattr $C$DW$107, DW_AT_decl_line(0x29)
    1715        .dwattr $C$DW$107, DW_AT_decl_column(0x02)
    1716$C$DW$108       .dwtag  DW_TAG_member
    1717        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$122)
    1718        .dwattr $C$DW$108, DW_AT_name("$P$T1")
    1719        .dwattr $C$DW$108, DW_AT_TI_symbol_name("$P$T1")
    1720        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1721        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1722        .dwattr $C$DW$108, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1723        .dwattr $C$DW$108, DW_AT_decl_line(0x33)
    1724        .dwattr $C$DW$108, DW_AT_decl_column(0x02)
    1725$C$DW$109       .dwtag  DW_TAG_member
    1726        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$124)
    1727        .dwattr $C$DW$109, DW_AT_name("$P$T2")
    1728        .dwattr $C$DW$109, DW_AT_TI_symbol_name("$P$T2")
    1729        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1730        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1731        .dwattr $C$DW$109, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1732        .dwattr $C$DW$109, DW_AT_decl_line(0x41)
    1733        .dwattr $C$DW$109, DW_AT_decl_column(0x02)
    1734$C$DW$110       .dwtag  DW_TAG_member
    1735        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$126)
    1736        .dwattr $C$DW$110, DW_AT_name("$P$T3")
    1737        .dwattr $C$DW$110, DW_AT_TI_symbol_name("$P$T3")
    1738        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1739        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1740        .dwattr $C$DW$110, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1741        .dwattr $C$DW$110, DW_AT_decl_line(0x54)
    1742        .dwattr $C$DW$110, DW_AT_decl_column(0x02)
    1743$C$DW$111       .dwtag  DW_TAG_member
    1744        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$128)
    1745        .dwattr $C$DW$111, DW_AT_name("$P$T4")
    1746        .dwattr $C$DW$111, DW_AT_TI_symbol_name("$P$T4")
    1747        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1748        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1749        .dwattr $C$DW$111, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1750        .dwattr $C$DW$111, DW_AT_decl_line(0x67)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   33

    1751        .dwattr $C$DW$111, DW_AT_decl_column(0x02)
    1752$C$DW$112       .dwtag  DW_TAG_member
    1753        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$130)
    1754        .dwattr $C$DW$112, DW_AT_name("$P$T5")
    1755        .dwattr $C$DW$112, DW_AT_TI_symbol_name("$P$T5")
    1756        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1757        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1758        .dwattr $C$DW$112, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1759        .dwattr $C$DW$112, DW_AT_decl_line(0x83)
    1760        .dwattr $C$DW$112, DW_AT_decl_column(0x02)
    1761$C$DW$113       .dwtag  DW_TAG_member
    1762        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$132)
    1763        .dwattr $C$DW$113, DW_AT_name("$P$T6")
    1764        .dwattr $C$DW$113, DW_AT_TI_symbol_name("$P$T6")
    1765        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1766        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1767        .dwattr $C$DW$113, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1768        .dwattr $C$DW$113, DW_AT_decl_line(0x92)
    1769        .dwattr $C$DW$113, DW_AT_decl_column(0x02)
    1770$C$DW$114       .dwtag  DW_TAG_member
    1771        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$134)
    1772        .dwattr $C$DW$114, DW_AT_name("$P$T7")
    1773        .dwattr $C$DW$114, DW_AT_TI_symbol_name("$P$T7")
    1774        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1775        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1776        .dwattr $C$DW$114, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1777        .dwattr $C$DW$114, DW_AT_decl_line(0xa0)
    1778        .dwattr $C$DW$114, DW_AT_decl_column(0x02)
    1779$C$DW$115       .dwtag  DW_TAG_member
    1780        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$136)
    1781        .dwattr $C$DW$115, DW_AT_name("$P$T8")
    1782        .dwattr $C$DW$115, DW_AT_TI_symbol_name("$P$T8")
    1783        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1784        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1785        .dwattr $C$DW$115, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1786        .dwattr $C$DW$115, DW_AT_decl_line(0xaf)
    1787        .dwattr $C$DW$115, DW_AT_decl_column(0x02)
    1788$C$DW$116       .dwtag  DW_TAG_member
    1789        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$32)
    1790        .dwattr $C$DW$116, DW_AT_name("rsvd24")
    1791        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd24")
    1792        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1793        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1794        .dwattr $C$DW$116, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1795        .dwattr $C$DW$116, DW_AT_decl_line(0xbc)
    1796        .dwattr $C$DW$116, DW_AT_decl_column(0x0b)
    1797$C$DW$117       .dwtag  DW_TAG_member
    1798        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$138)
    1799        .dwattr $C$DW$117, DW_AT_name("$P$T9")
    1800        .dwattr $C$DW$117, DW_AT_TI_symbol_name("$P$T9")
    1801        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1802        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1803        .dwattr $C$DW$117, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1804        .dwattr $C$DW$117, DW_AT_decl_line(0xc0)
    1805        .dwattr $C$DW$117, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   34

    1806$C$DW$118       .dwtag  DW_TAG_member
    1807        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$33)
    1808        .dwattr $C$DW$118, DW_AT_name("rsvd2c")
    1809        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd2c")
    1810        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1811        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1812        .dwattr $C$DW$118, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1813        .dwattr $C$DW$118, DW_AT_decl_line(0xcb)
    1814        .dwattr $C$DW$118, DW_AT_decl_column(0x0b)
    1815$C$DW$119       .dwtag  DW_TAG_member
    1816        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$140)
    1817        .dwattr $C$DW$119, DW_AT_name("$P$T10")
    1818        .dwattr $C$DW$119, DW_AT_TI_symbol_name("$P$T10")
    1819        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1820        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1821        .dwattr $C$DW$119, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1822        .dwattr $C$DW$119, DW_AT_decl_line(0xcf)
    1823        .dwattr $C$DW$119, DW_AT_decl_column(0x02)
    1824$C$DW$120       .dwtag  DW_TAG_member
    1825        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$142)
    1826        .dwattr $C$DW$120, DW_AT_name("$P$T11")
    1827        .dwattr $C$DW$120, DW_AT_TI_symbol_name("$P$T11")
    1828        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1829        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1830        .dwattr $C$DW$120, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1831        .dwattr $C$DW$120, DW_AT_decl_line(0xda)
    1832        .dwattr $C$DW$120, DW_AT_decl_column(0x02)
    1833$C$DW$121       .dwtag  DW_TAG_member
    1834        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$34)
    1835        .dwattr $C$DW$121, DW_AT_name("rsvd38")
    1836        .dwattr $C$DW$121, DW_AT_TI_symbol_name("rsvd38")
    1837        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1838        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1839        .dwattr $C$DW$121, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1840        .dwattr $C$DW$121, DW_AT_decl_line(0xe5)
    1841        .dwattr $C$DW$121, DW_AT_decl_column(0x0b)
    1842$C$DW$122       .dwtag  DW_TAG_member
    1843        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$144)
    1844        .dwattr $C$DW$122, DW_AT_name("$P$T12")
    1845        .dwattr $C$DW$122, DW_AT_TI_symbol_name("$P$T12")
    1846        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1847        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1848        .dwattr $C$DW$122, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1849        .dwattr $C$DW$122, DW_AT_decl_line(0xe8)
    1850        .dwattr $C$DW$122, DW_AT_decl_column(0x02)
    1851        .dwendtag $C$DW$T$35
    1852
    1853        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1854        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1855        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1856$C$DW$T$295     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1857        .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$35)
    1858        .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
    1859        .dwattr $C$DW$T$295, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_bui
    1860        .dwattr $C$DW$T$295, DW_AT_decl_line(0xf0)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   35

    1861        .dwattr $C$DW$T$295, DW_AT_decl_column(0x03)
    1862$C$DW$T$296     .dwtag  DW_TAG_volatile_type
    1863        .dwattr $C$DW$T$296, DW_AT_type(*$C$DW$T$295)
    1864
    1865$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1866        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1867$C$DW$123       .dwtag  DW_TAG_member
    1868        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1869        .dwattr $C$DW$123, DW_AT_name("REV_MINOR")
    1870        .dwattr $C$DW$123, DW_AT_TI_symbol_name("REV_MINOR")
    1871        .dwattr $C$DW$123, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1872        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1874        .dwattr $C$DW$123, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1875        .dwattr $C$DW$123, DW_AT_decl_line(0x2d)
    1876        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1877$C$DW$124       .dwtag  DW_TAG_member
    1878        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1879        .dwattr $C$DW$124, DW_AT_name("REV_CUSTOM")
    1880        .dwattr $C$DW$124, DW_AT_TI_symbol_name("REV_CUSTOM")
    1881        .dwattr $C$DW$124, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1882        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1883        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1884        .dwattr $C$DW$124, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1885        .dwattr $C$DW$124, DW_AT_decl_line(0x2e)
    1886        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1887$C$DW$125       .dwtag  DW_TAG_member
    1888        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1889        .dwattr $C$DW$125, DW_AT_name("REV_MAJOR")
    1890        .dwattr $C$DW$125, DW_AT_TI_symbol_name("REV_MAJOR")
    1891        .dwattr $C$DW$125, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1892        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1894        .dwattr $C$DW$125, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1895        .dwattr $C$DW$125, DW_AT_decl_line(0x2f)
    1896        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1897$C$DW$126       .dwtag  DW_TAG_member
    1898        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1899        .dwattr $C$DW$126, DW_AT_name("REV_RTL")
    1900        .dwattr $C$DW$126, DW_AT_TI_symbol_name("REV_RTL")
    1901        .dwattr $C$DW$126, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1902        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1904        .dwattr $C$DW$126, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1905        .dwattr $C$DW$126, DW_AT_decl_line(0x30)
    1906        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1907$C$DW$127       .dwtag  DW_TAG_member
    1908        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1909        .dwattr $C$DW$127, DW_AT_name("REV_MODULE")
    1910        .dwattr $C$DW$127, DW_AT_TI_symbol_name("REV_MODULE")
    1911        .dwattr $C$DW$127, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1912        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1914        .dwattr $C$DW$127, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1915        .dwattr $C$DW$127, DW_AT_decl_line(0x31)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   36

    1916        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1917$C$DW$128       .dwtag  DW_TAG_member
    1918        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1919        .dwattr $C$DW$128, DW_AT_name("rsvd28")
    1920        .dwattr $C$DW$128, DW_AT_TI_symbol_name("rsvd28")
    1921        .dwattr $C$DW$128, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1922        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1924        .dwattr $C$DW$128, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1925        .dwattr $C$DW$128, DW_AT_decl_line(0x32)
    1926        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1927$C$DW$129       .dwtag  DW_TAG_member
    1928        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1929        .dwattr $C$DW$129, DW_AT_name("REV_SCHEME")
    1930        .dwattr $C$DW$129, DW_AT_TI_symbol_name("REV_SCHEME")
    1931        .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1932        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1934        .dwattr $C$DW$129, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1935        .dwattr $C$DW$129, DW_AT_decl_line(0x33)
    1936        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1937        .dwendtag $C$DW$T$36
    1938
    1939        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1940        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1941        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1942$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    1943        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$36)
    1944
    1945$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1946        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1947$C$DW$130       .dwtag  DW_TAG_member
    1948        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1949        .dwattr $C$DW$130, DW_AT_name("rsvd0")
    1950        .dwattr $C$DW$130, DW_AT_TI_symbol_name("rsvd0")
    1951        .dwattr $C$DW$130, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1952        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1954        .dwattr $C$DW$130, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1955        .dwattr $C$DW$130, DW_AT_decl_line(0x3d)
    1956        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1957$C$DW$131       .dwtag  DW_TAG_member
    1958        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1959        .dwattr $C$DW$131, DW_AT_name("NEST_MODE")
    1960        .dwattr $C$DW$131, DW_AT_TI_symbol_name("NEST_MODE")
    1961        .dwattr $C$DW$131, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1962        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1964        .dwattr $C$DW$131, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1965        .dwattr $C$DW$131, DW_AT_decl_line(0x3e)
    1966        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1967$C$DW$132       .dwtag  DW_TAG_member
    1968        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1969        .dwattr $C$DW$132, DW_AT_name("rsvd4")
    1970        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd4")
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   37

    1971        .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1972        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1974        .dwattr $C$DW$132, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1975        .dwattr $C$DW$132, DW_AT_decl_line(0x3f)
    1976        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1977        .dwendtag $C$DW$T$37
    1978
    1979        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1980        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    1981        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1982$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    1983        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$37)
    1984
    1985$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1986        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1987$C$DW$133       .dwtag  DW_TAG_member
    1988        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1989        .dwattr $C$DW$133, DW_AT_name("EN_HINT_ANY")
    1990        .dwattr $C$DW$133, DW_AT_TI_symbol_name("EN_HINT_ANY")
    1991        .dwattr $C$DW$133, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1992        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1993        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1994        .dwattr $C$DW$133, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1995        .dwattr $C$DW$133, DW_AT_decl_line(0x4c)
    1996        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1997$C$DW$134       .dwtag  DW_TAG_member
    1998        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1999        .dwattr $C$DW$134, DW_AT_name("rsvd1")
    2000        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd1")
    2001        .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2002        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2004        .dwattr $C$DW$134, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2005        .dwattr $C$DW$134, DW_AT_decl_line(0x4d)
    2006        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2007        .dwendtag $C$DW$T$38
    2008
    2009        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    2010        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2011        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2012$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2013        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$38)
    2014
    2015$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2016        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2017$C$DW$135       .dwtag  DW_TAG_member
    2018        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2019        .dwattr $C$DW$135, DW_AT_name("GLB_NEST_LEVEL")
    2020        .dwattr $C$DW$135, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2021        .dwattr $C$DW$135, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2022        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2024        .dwattr $C$DW$135, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2025        .dwattr $C$DW$135, DW_AT_decl_line(0x5a)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   38

    2026        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2027$C$DW$136       .dwtag  DW_TAG_member
    2028        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2029        .dwattr $C$DW$136, DW_AT_name("rsvd9")
    2030        .dwattr $C$DW$136, DW_AT_TI_symbol_name("rsvd9")
    2031        .dwattr $C$DW$136, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2032        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2034        .dwattr $C$DW$136, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2035        .dwattr $C$DW$136, DW_AT_decl_line(0x5b)
    2036        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    2037$C$DW$137       .dwtag  DW_TAG_member
    2038        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2039        .dwattr $C$DW$137, DW_AT_name("AUTO_OVERRIDE")
    2040        .dwattr $C$DW$137, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2041        .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2042        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2044        .dwattr $C$DW$137, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2045        .dwattr $C$DW$137, DW_AT_decl_line(0x5c)
    2046        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2047        .dwendtag $C$DW$T$39
    2048
    2049        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    2050        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2051        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2052$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2053        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$39)
    2054
    2055$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2056        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2057$C$DW$138       .dwtag  DW_TAG_member
    2058        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2059        .dwattr $C$DW$138, DW_AT_name("STS_SET_IDX")
    2060        .dwattr $C$DW$138, DW_AT_TI_symbol_name("STS_SET_IDX")
    2061        .dwattr $C$DW$138, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2062        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2063        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2064        .dwattr $C$DW$138, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2065        .dwattr $C$DW$138, DW_AT_decl_line(0x66)
    2066        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    2067$C$DW$139       .dwtag  DW_TAG_member
    2068        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    2069        .dwattr $C$DW$139, DW_AT_name("rsvd10")
    2070        .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd10")
    2071        .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2072        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2074        .dwattr $C$DW$139, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2075        .dwattr $C$DW$139, DW_AT_decl_line(0x67)
    2076        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    2077        .dwendtag $C$DW$T$40
    2078
    2079        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    2080        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
PRU Assembler Unix v2.1.4 Tue Jul  2 18:45:23 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_CAN.asm                                               PAGE   39

    2081        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2082$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2083        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$40)
    2084
    2085$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2086        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2087$C$DW$140       .dwtag  DW_TAG_member
    2088        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    2089        .dwattr $C$DW$140, DW_AT_name("STS_CLR_IDX")
    2090        .dwattr $C$DW$140, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2091        .dwattr $C$DW$140, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2092        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2094        .dwattr $C$DW$140, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2095        .dwattr $C$DW$140, DW_AT_decl_line(0x71)
    2096        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    2097$C$DW$141       .dwtag  DW_TAG_member
    2098        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    2099        .dwattr $C$DW$141, DW_AT_name("rsvd10")
    2100        .dwattr $C$DW$141, DW_AT_TI_symbol_name("rsvd10")
    2101        .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2102        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2104        .dwattr $C$DW$141, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    2105        .dwattr $C$DW$141, DW_AT_decl_line(0x72)
    2106        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    2107        .dwendtag $C$DW$T$41
    2108
    2109        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    2110        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2111        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2112$C$DW$T$155     .dwtag  DW_TAG_volatile_type
    2113        .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$41)
    2114
    2115$C$DW$T$42      .dwtag  DW_TAG_structure_type
    2116        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    2117$C$DW$142       .dwtag  DW_TAG_member
    2118        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
