PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Mon Apr  1 15:37:25 2019                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("PRU_experiment_UART.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/arturs/AE_Custom_Linux_kernels_Yocto/AE_PRU_uart_exper
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_UART1
      14        .global __PRU_CREG_PRU_SHAREDMEM
      15        .global __PRU_CREG_PRU_SHAREDMEM
      16        .global __PRU_CREG_PRU_SHAREDMEM
      17
      18$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      19        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      20        .dwattr $C$DW$1, DW_AT_declaration

     337        .dwpsn  file "PRU_experiment_UART.c",line 195,column 2,is_stmt,isa 0
     338;----------------------------------------------------------------------
     339; 195 | shared_freq_1 = 1;                                                     
     340;----------------------------------------------------------------------
     341 000000f0 000000240001E0          LDI       r0, 0x0001            ; [ALU_PRU] |195| 
     342 000000f4 00000081002080!         SBCO      &r0, __PRU_CREG_PRU_SHAREDMEM, $CSBREL(||shared_freq_1||+0), 4 ; [ALU_PRU] |195| sha
     343        .dwpsn  file "PRU_experiment_UART.c",line 198,column 2,is_stmt,isa 0
     344;----------------------------------------------------------------------
     345; 198 | if (shared_freq_1 == 1)                                                
     346; 199 |         shared_freq_2 = shared_freq_2 + 1;                             
     347; 200 | else                                                                   
     348;----------------------------------------------------------------------
     349 000000f8 00000091002080!         LBCO      &r0, __PRU_CREG_PRU_SHAREDMEM, $CSBREL(||shared_freq_1||+0), 4 ; [ALU_PRU] |198| sha
     350 000000fc 0000005101E003          QBEQ      ||$C$L1||, r0, 0x01   ; [ALU_PRU] |198| 
     351;* --------------------------------------------------------------------------*
     352        .dwpsn  file "PRU_experiment_UART.c",line 201,column 3,is_stmt,isa 0
     353;----------------------------------------------------------------------
     354; 201 | shared_freq_2 = shared_freq_3;                                         
     355; 205 | while (1) {                                                            
     356;----------------------------------------------------------------------
     357 00000100 00000091002080!         LBCO      &r0, __PRU_CREG_PRU_SHAREDMEM, $CSBREL(||shared_freq_3||+0), 4 ; [ALU_PRU] |201| sha
     358 00000104 00000021000000!         JMP       ||$C$L2||             ; [ALU_PRU] |201| 
     359;* --------------------------------------------------------------------------*
     360 00000108                 ||$C$L1||:    
     361        .dwpsn  file "PRU_experiment_UART.c",line 199,column 3,is_stmt,isa 0
     362 00000108 00000091002080!         LBCO      &r0, __PRU_CREG_PRU_SHAREDMEM, $CSBREL(||shared_freq_2||+0), 4 ; [ALU_PRU] |199| sha
     363 0000010c 0000000101E0E0          ADD       r0, r0, 0x01          ; [ALU_PRU] |199| 
     364;* --------------------------------------------------------------------------*
     365 00000110                 ||$C$L2||:    
     366 00000110 00000081002080!         SBCO      &r0, __PRU_CREG_PRU_SHAREDMEM, $CSBREL(||shared_freq_2||+0), 4 ; [ALU_PRU] |199| sha
     367 00000114 000000240060E1          LDI       r1, 0x0060            ; [ALU_PRU] $O$K55
     368;* --------------------------------------------------------------------------*
     369;*   BEGIN LOOP ||$C$L3||
     370;*
     371;*   Loop source line                : 205
     372;*   Loop closing brace source line  : 208
     373;*   Known Minimum Trip Count        : 1
     374;*   Known Maximum Trip Count        : 4294967295
     375;*   Known Max Trip Count Factor     : 1
     376;* --------------------------------------------------------------------------*
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE    8

     377 00000118                 ||$C$L3||:    
     378        .dwpsn  file "PRU_experiment_UART.c",line 206,column 3,is_stmt,isa 0
     379;----------------------------------------------------------------------
     380; 206 | __delay_cycles(100000000); //# 500ms wait                              
     381;----------------------------------------------------------------------
     382        .newblock
     383 00000118 F07F802402FAC0          LDI32    r0, 49999999
         0000011f 00000000004024 
     384 00000120 0000000501E0E0  $1:     SUB      r0, r0, 1
     385 00000124 0000006F00E0FF          QBNE     $1, r0, 0             ; [ALU_PRU] |206| 
     386        .dwpsn  file "PRU_experiment_UART.c",line 207,column 3,is_stmt,isa 0
     387;----------------------------------------------------------------------
     388; 207 | UART1_THR = 0x60;                                                      
     389; 211 | __halt();                                                              
     390;----------------------------------------------------------------------
     391 00000128 00000081000081!         SBCO      &r1.w0, __PRU_CREG_UART1, $CSBREL(||CT_UART1||+0), 2 ; [ALU_PRU] |207| CT_UART1,$O$K
     392        .dwpsn  file "PRU_experiment_UART.c",line 205,column 9,is_stmt,isa 0
     393 0000012c 00000021000000!         JMP       ||$C$L3||             ; [ALU_PRU] |205| 
     394;* --------------------------------------------------------------------------*
     395        .dwattr $C$DW$10, DW_AT_TI_end_file("PRU_experiment_UART.c")
     396        .dwattr $C$DW$10, DW_AT_TI_end_line(0xd4)
     397        .dwattr $C$DW$10, DW_AT_TI_end_column(0x01)
     398        .dwendentry
     399        .dwendtag $C$DW$10
     400
     401
     402;******************************************************************************
     403;* TYPE INFORMATION                                                           *
     404;******************************************************************************
     405
     406$C$DW$T$19      .dwtag  DW_TAG_structure_type
     407        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     408$C$DW$14        .dwtag  DW_TAG_member
     409        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     410        .dwattr $C$DW$14, DW_AT_name("REVID")
     411        .dwattr $C$DW$14, DW_AT_TI_symbol_name("REVID")
     412        .dwattr $C$DW$14, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     413        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     414        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     415        .dwattr $C$DW$14, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     416        .dwattr $C$DW$14, DW_AT_decl_line(0x2d)
     417        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     418        .dwendtag $C$DW$T$19
     419
     420        .dwattr $C$DW$T$19, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     421        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     422        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     423$C$DW$T$48      .dwtag  DW_TAG_volatile_type
     424        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
     425
     426$C$DW$T$20      .dwtag  DW_TAG_structure_type
     427        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     428$C$DW$15        .dwtag  DW_TAG_member
     429        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     430        .dwattr $C$DW$15, DW_AT_name("IDLE_MODE")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE    9

     431        .dwattr $C$DW$15, DW_AT_TI_symbol_name("IDLE_MODE")
     432        .dwattr $C$DW$15, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     433        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     434        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     435        .dwattr $C$DW$15, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     436        .dwattr $C$DW$15, DW_AT_decl_line(0x37)
     437        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     438$C$DW$16        .dwtag  DW_TAG_member
     439        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     440        .dwattr $C$DW$16, DW_AT_name("STANDBY_MODE")
     441        .dwattr $C$DW$16, DW_AT_TI_symbol_name("STANDBY_MODE")
     442        .dwattr $C$DW$16, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     443        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     445        .dwattr $C$DW$16, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     446        .dwattr $C$DW$16, DW_AT_decl_line(0x38)
     447        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     448$C$DW$17        .dwtag  DW_TAG_member
     449        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     450        .dwattr $C$DW$17, DW_AT_name("STANDBY_INIT")
     451        .dwattr $C$DW$17, DW_AT_TI_symbol_name("STANDBY_INIT")
     452        .dwattr $C$DW$17, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     453        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     454        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     455        .dwattr $C$DW$17, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     456        .dwattr $C$DW$17, DW_AT_decl_line(0x39)
     457        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     458$C$DW$18        .dwtag  DW_TAG_member
     459        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     460        .dwattr $C$DW$18, DW_AT_name("SUB_MWAIT")
     461        .dwattr $C$DW$18, DW_AT_TI_symbol_name("SUB_MWAIT")
     462        .dwattr $C$DW$18, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     463        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     465        .dwattr $C$DW$18, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     466        .dwattr $C$DW$18, DW_AT_decl_line(0x3a)
     467        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     468$C$DW$19        .dwtag  DW_TAG_member
     469        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     470        .dwattr $C$DW$19, DW_AT_name("rsvd6")
     471        .dwattr $C$DW$19, DW_AT_TI_symbol_name("rsvd6")
     472        .dwattr $C$DW$19, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     473        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     475        .dwattr $C$DW$19, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     476        .dwattr $C$DW$19, DW_AT_decl_line(0x3b)
     477        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     478        .dwendtag $C$DW$T$20
     479
     480        .dwattr $C$DW$T$20, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     481        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     482        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     483$C$DW$T$50      .dwtag  DW_TAG_volatile_type
     484        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     485
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   10

     486$C$DW$T$21      .dwtag  DW_TAG_structure_type
     487        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     488$C$DW$20        .dwtag  DW_TAG_member
     489        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     490        .dwattr $C$DW$20, DW_AT_name("PRU0_GPI_MODE")
     491        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     492        .dwattr $C$DW$20, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     493        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     495        .dwattr $C$DW$20, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     496        .dwattr $C$DW$20, DW_AT_decl_line(0x45)
     497        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     498$C$DW$21        .dwtag  DW_TAG_member
     499        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     500        .dwattr $C$DW$21, DW_AT_name("PRU0_GPI_CLK_MODE")
     501        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     502        .dwattr $C$DW$21, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     503        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     504        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     505        .dwattr $C$DW$21, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     506        .dwattr $C$DW$21, DW_AT_decl_line(0x46)
     507        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     508$C$DW$22        .dwtag  DW_TAG_member
     509        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     510        .dwattr $C$DW$22, DW_AT_name("PRU0_GPI_DIV0")
     511        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     512        .dwattr $C$DW$22, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     513        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     515        .dwattr $C$DW$22, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     516        .dwattr $C$DW$22, DW_AT_decl_line(0x47)
     517        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     518$C$DW$23        .dwtag  DW_TAG_member
     519        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     520        .dwattr $C$DW$23, DW_AT_name("PRU0_GPI_DIV1")
     521        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     522        .dwattr $C$DW$23, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     523        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     525        .dwattr $C$DW$23, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     526        .dwattr $C$DW$23, DW_AT_decl_line(0x48)
     527        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     528$C$DW$24        .dwtag  DW_TAG_member
     529        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     530        .dwattr $C$DW$24, DW_AT_name("PRU0_GPI_SB")
     531        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     532        .dwattr $C$DW$24, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     533        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     534        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     535        .dwattr $C$DW$24, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     536        .dwattr $C$DW$24, DW_AT_decl_line(0x49)
     537        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     538$C$DW$25        .dwtag  DW_TAG_member
     539        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     540        .dwattr $C$DW$25, DW_AT_name("PRU0_GPO_MODE")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   11

     541        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     542        .dwattr $C$DW$25, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     543        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     544        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     545        .dwattr $C$DW$25, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     546        .dwattr $C$DW$25, DW_AT_decl_line(0x4a)
     547        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     548$C$DW$26        .dwtag  DW_TAG_member
     549        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     550        .dwattr $C$DW$26, DW_AT_name("PRU0_GPO_DIV0")
     551        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     552        .dwattr $C$DW$26, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     553        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     555        .dwattr $C$DW$26, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     556        .dwattr $C$DW$26, DW_AT_decl_line(0x4b)
     557        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     558$C$DW$27        .dwtag  DW_TAG_member
     559        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     560        .dwattr $C$DW$27, DW_AT_name("PRU0_GPO_DIV1")
     561        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     562        .dwattr $C$DW$27, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     563        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     565        .dwattr $C$DW$27, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     566        .dwattr $C$DW$27, DW_AT_decl_line(0x4c)
     567        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     568$C$DW$28        .dwtag  DW_TAG_member
     569        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     570        .dwattr $C$DW$28, DW_AT_name("PRU0_GPO_SH_SEL")
     571        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     572        .dwattr $C$DW$28, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     573        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     575        .dwattr $C$DW$28, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     576        .dwattr $C$DW$28, DW_AT_decl_line(0x4d)
     577        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     578$C$DW$29        .dwtag  DW_TAG_member
     579        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     580        .dwattr $C$DW$29, DW_AT_name("rsvd26")
     581        .dwattr $C$DW$29, DW_AT_TI_symbol_name("rsvd26")
     582        .dwattr $C$DW$29, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     583        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     585        .dwattr $C$DW$29, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     586        .dwattr $C$DW$29, DW_AT_decl_line(0x4e)
     587        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     588        .dwendtag $C$DW$T$21
     589
     590        .dwattr $C$DW$T$21, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     591        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     592        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     593$C$DW$T$52      .dwtag  DW_TAG_volatile_type
     594        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
     595
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   12

     596$C$DW$T$22      .dwtag  DW_TAG_structure_type
     597        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     598$C$DW$30        .dwtag  DW_TAG_member
     599        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     600        .dwattr $C$DW$30, DW_AT_name("PRU1_GPI_MODE")
     601        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     602        .dwattr $C$DW$30, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     603        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     605        .dwattr $C$DW$30, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     606        .dwattr $C$DW$30, DW_AT_decl_line(0x58)
     607        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     608$C$DW$31        .dwtag  DW_TAG_member
     609        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     610        .dwattr $C$DW$31, DW_AT_name("PRU1_GPI_CLK_MODE")
     611        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     612        .dwattr $C$DW$31, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     613        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     615        .dwattr $C$DW$31, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     616        .dwattr $C$DW$31, DW_AT_decl_line(0x59)
     617        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     618$C$DW$32        .dwtag  DW_TAG_member
     619        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     620        .dwattr $C$DW$32, DW_AT_name("PRU1_GPI_DIV0")
     621        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     622        .dwattr $C$DW$32, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     623        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     624        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     625        .dwattr $C$DW$32, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     626        .dwattr $C$DW$32, DW_AT_decl_line(0x5a)
     627        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     628$C$DW$33        .dwtag  DW_TAG_member
     629        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     630        .dwattr $C$DW$33, DW_AT_name("PRU1_GPI_DIV1")
     631        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     632        .dwattr $C$DW$33, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     633        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     635        .dwattr $C$DW$33, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     636        .dwattr $C$DW$33, DW_AT_decl_line(0x5b)
     637        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     638$C$DW$34        .dwtag  DW_TAG_member
     639        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     640        .dwattr $C$DW$34, DW_AT_name("PRU1_GPI_SB")
     641        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     642        .dwattr $C$DW$34, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     643        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     645        .dwattr $C$DW$34, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     646        .dwattr $C$DW$34, DW_AT_decl_line(0x5c)
     647        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     648$C$DW$35        .dwtag  DW_TAG_member
     649        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     650        .dwattr $C$DW$35, DW_AT_name("PRU1_GPO_MODE")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   13

     651        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     652        .dwattr $C$DW$35, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     653        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     654        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     655        .dwattr $C$DW$35, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     656        .dwattr $C$DW$35, DW_AT_decl_line(0x5d)
     657        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     658$C$DW$36        .dwtag  DW_TAG_member
     659        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     660        .dwattr $C$DW$36, DW_AT_name("PRU1_GPO_DIV0")
     661        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     662        .dwattr $C$DW$36, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     663        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     665        .dwattr $C$DW$36, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     666        .dwattr $C$DW$36, DW_AT_decl_line(0x5e)
     667        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     668$C$DW$37        .dwtag  DW_TAG_member
     669        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     670        .dwattr $C$DW$37, DW_AT_name("PRU1_GPO_DIV1")
     671        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     672        .dwattr $C$DW$37, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     673        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     675        .dwattr $C$DW$37, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     676        .dwattr $C$DW$37, DW_AT_decl_line(0x5f)
     677        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     678$C$DW$38        .dwtag  DW_TAG_member
     679        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     680        .dwattr $C$DW$38, DW_AT_name("PRU1_GPO_SH_SEL")
     681        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     682        .dwattr $C$DW$38, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     683        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     685        .dwattr $C$DW$38, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     686        .dwattr $C$DW$38, DW_AT_decl_line(0x60)
     687        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     688$C$DW$39        .dwtag  DW_TAG_member
     689        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     690        .dwattr $C$DW$39, DW_AT_name("rsvd26")
     691        .dwattr $C$DW$39, DW_AT_TI_symbol_name("rsvd26")
     692        .dwattr $C$DW$39, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     693        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     694        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     695        .dwattr $C$DW$39, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     696        .dwattr $C$DW$39, DW_AT_decl_line(0x61)
     697        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     698        .dwendtag $C$DW$T$22
     699
     700        .dwattr $C$DW$T$22, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     701        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     702        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     703$C$DW$T$54      .dwtag  DW_TAG_volatile_type
     704        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$22)
     705
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   14

     706$C$DW$T$23      .dwtag  DW_TAG_structure_type
     707        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     708$C$DW$40        .dwtag  DW_TAG_member
     709        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     710        .dwattr $C$DW$40, DW_AT_name("PRU0_CLK_STOP_REQ")
     711        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     712        .dwattr $C$DW$40, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     713        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     715        .dwattr $C$DW$40, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     716        .dwattr $C$DW$40, DW_AT_decl_line(0x6b)
     717        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     718$C$DW$41        .dwtag  DW_TAG_member
     719        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     720        .dwattr $C$DW$41, DW_AT_name("PRU0_CLK_STOP_ACK")
     721        .dwattr $C$DW$41, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     722        .dwattr $C$DW$41, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     723        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     725        .dwattr $C$DW$41, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     726        .dwattr $C$DW$41, DW_AT_decl_line(0x6c)
     727        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     728$C$DW$42        .dwtag  DW_TAG_member
     729        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     730        .dwattr $C$DW$42, DW_AT_name("PRU0_CLK_EN")
     731        .dwattr $C$DW$42, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     732        .dwattr $C$DW$42, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     733        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     735        .dwattr $C$DW$42, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     736        .dwattr $C$DW$42, DW_AT_decl_line(0x6d)
     737        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     738$C$DW$43        .dwtag  DW_TAG_member
     739        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     740        .dwattr $C$DW$43, DW_AT_name("PRU1_CLK_STOP_REQ")
     741        .dwattr $C$DW$43, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     742        .dwattr $C$DW$43, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     743        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     745        .dwattr $C$DW$43, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     746        .dwattr $C$DW$43, DW_AT_decl_line(0x6e)
     747        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     748$C$DW$44        .dwtag  DW_TAG_member
     749        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     750        .dwattr $C$DW$44, DW_AT_name("PRU1_CLK_STOP_ACK")
     751        .dwattr $C$DW$44, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     752        .dwattr $C$DW$44, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     753        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     755        .dwattr $C$DW$44, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     756        .dwattr $C$DW$44, DW_AT_decl_line(0x6f)
     757        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     758$C$DW$45        .dwtag  DW_TAG_member
     759        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     760        .dwattr $C$DW$45, DW_AT_name("PRU1_CLK_EN")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   15

     761        .dwattr $C$DW$45, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     762        .dwattr $C$DW$45, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     763        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     765        .dwattr $C$DW$45, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     766        .dwattr $C$DW$45, DW_AT_decl_line(0x70)
     767        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     768$C$DW$46        .dwtag  DW_TAG_member
     769        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     770        .dwattr $C$DW$46, DW_AT_name("INTC_CLK_STOP_REQ")
     771        .dwattr $C$DW$46, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     772        .dwattr $C$DW$46, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     773        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     775        .dwattr $C$DW$46, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     776        .dwattr $C$DW$46, DW_AT_decl_line(0x71)
     777        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     778$C$DW$47        .dwtag  DW_TAG_member
     779        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     780        .dwattr $C$DW$47, DW_AT_name("INTC_CLK_STOP_ACK")
     781        .dwattr $C$DW$47, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     782        .dwattr $C$DW$47, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     783        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     785        .dwattr $C$DW$47, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     786        .dwattr $C$DW$47, DW_AT_decl_line(0x72)
     787        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     788$C$DW$48        .dwtag  DW_TAG_member
     789        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     790        .dwattr $C$DW$48, DW_AT_name("INTC_CLK_EN")
     791        .dwattr $C$DW$48, DW_AT_TI_symbol_name("INTC_CLK_EN")
     792        .dwattr $C$DW$48, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     793        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     795        .dwattr $C$DW$48, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     796        .dwattr $C$DW$48, DW_AT_decl_line(0x73)
     797        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     798$C$DW$49        .dwtag  DW_TAG_member
     799        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     800        .dwattr $C$DW$49, DW_AT_name("UART_CLK_STOP_REQ")
     801        .dwattr $C$DW$49, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     802        .dwattr $C$DW$49, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     803        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     805        .dwattr $C$DW$49, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     806        .dwattr $C$DW$49, DW_AT_decl_line(0x74)
     807        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     808$C$DW$50        .dwtag  DW_TAG_member
     809        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     810        .dwattr $C$DW$50, DW_AT_name("UART_CLK_STOP_ACK")
     811        .dwattr $C$DW$50, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     812        .dwattr $C$DW$50, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     813        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     815        .dwattr $C$DW$50, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   16

     816        .dwattr $C$DW$50, DW_AT_decl_line(0x75)
     817        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     818$C$DW$51        .dwtag  DW_TAG_member
     819        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     820        .dwattr $C$DW$51, DW_AT_name("UART_CLK_EN")
     821        .dwattr $C$DW$51, DW_AT_TI_symbol_name("UART_CLK_EN")
     822        .dwattr $C$DW$51, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     823        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     825        .dwattr $C$DW$51, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     826        .dwattr $C$DW$51, DW_AT_decl_line(0x76)
     827        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     828$C$DW$52        .dwtag  DW_TAG_member
     829        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     830        .dwattr $C$DW$52, DW_AT_name("ECAP_CLK_STOP_REQ")
     831        .dwattr $C$DW$52, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     832        .dwattr $C$DW$52, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     833        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     835        .dwattr $C$DW$52, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     836        .dwattr $C$DW$52, DW_AT_decl_line(0x77)
     837        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     838$C$DW$53        .dwtag  DW_TAG_member
     839        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     840        .dwattr $C$DW$53, DW_AT_name("ECAP_CLK_STOP_ACK")
     841        .dwattr $C$DW$53, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     842        .dwattr $C$DW$53, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     843        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     845        .dwattr $C$DW$53, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     846        .dwattr $C$DW$53, DW_AT_decl_line(0x78)
     847        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     848$C$DW$54        .dwtag  DW_TAG_member
     849        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     850        .dwattr $C$DW$54, DW_AT_name("ECAP_CLK_EN")
     851        .dwattr $C$DW$54, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     852        .dwattr $C$DW$54, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     853        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     855        .dwattr $C$DW$54, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     856        .dwattr $C$DW$54, DW_AT_decl_line(0x79)
     857        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     858$C$DW$55        .dwtag  DW_TAG_member
     859        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     860        .dwattr $C$DW$55, DW_AT_name("IEP_CLK_STOP_REQ")
     861        .dwattr $C$DW$55, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     862        .dwattr $C$DW$55, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     863        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     865        .dwattr $C$DW$55, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     866        .dwattr $C$DW$55, DW_AT_decl_line(0x7a)
     867        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     868$C$DW$56        .dwtag  DW_TAG_member
     869        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     870        .dwattr $C$DW$56, DW_AT_name("IEP_CLK_STOP_ACK")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   17

     871        .dwattr $C$DW$56, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     872        .dwattr $C$DW$56, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     873        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     875        .dwattr $C$DW$56, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     876        .dwattr $C$DW$56, DW_AT_decl_line(0x7b)
     877        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     878$C$DW$57        .dwtag  DW_TAG_member
     879        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     880        .dwattr $C$DW$57, DW_AT_name("IEP_CLK_EN")
     881        .dwattr $C$DW$57, DW_AT_TI_symbol_name("IEP_CLK_EN")
     882        .dwattr $C$DW$57, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     883        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     884        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     885        .dwattr $C$DW$57, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     886        .dwattr $C$DW$57, DW_AT_decl_line(0x7c)
     887        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     888$C$DW$58        .dwtag  DW_TAG_member
     889        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     890        .dwattr $C$DW$58, DW_AT_name("rsvd18")
     891        .dwattr $C$DW$58, DW_AT_TI_symbol_name("rsvd18")
     892        .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     893        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     895        .dwattr $C$DW$58, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     896        .dwattr $C$DW$58, DW_AT_decl_line(0x7d)
     897        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     898        .dwendtag $C$DW$T$23
     899
     900        .dwattr $C$DW$T$23, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     901        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     902        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     903$C$DW$T$56      .dwtag  DW_TAG_volatile_type
     904        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$23)
     905
     906$C$DW$T$24      .dwtag  DW_TAG_structure_type
     907        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     908$C$DW$59        .dwtag  DW_TAG_member
     909        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     910        .dwattr $C$DW$59, DW_AT_name("PRU0_IMEM_PE_RAW")
     911        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     912        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     913        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     915        .dwattr $C$DW$59, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     916        .dwattr $C$DW$59, DW_AT_decl_line(0x87)
     917        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     918$C$DW$60        .dwtag  DW_TAG_member
     919        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     920        .dwattr $C$DW$60, DW_AT_name("PRU0_DMEM_PE_RAW")
     921        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     922        .dwattr $C$DW$60, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     923        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     925        .dwattr $C$DW$60, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   18

     926        .dwattr $C$DW$60, DW_AT_decl_line(0x88)
     927        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     928$C$DW$61        .dwtag  DW_TAG_member
     929        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     930        .dwattr $C$DW$61, DW_AT_name("PRU1_IMEM_PE_RAW")
     931        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     932        .dwattr $C$DW$61, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     933        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     935        .dwattr $C$DW$61, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     936        .dwattr $C$DW$61, DW_AT_decl_line(0x89)
     937        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     938$C$DW$62        .dwtag  DW_TAG_member
     939        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     940        .dwattr $C$DW$62, DW_AT_name("PRU1_DMEM_PE_RAW")
     941        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     942        .dwattr $C$DW$62, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     943        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     945        .dwattr $C$DW$62, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     946        .dwattr $C$DW$62, DW_AT_decl_line(0x8a)
     947        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     948$C$DW$63        .dwtag  DW_TAG_member
     949        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     950        .dwattr $C$DW$63, DW_AT_name("RAM_PE_RAW")
     951        .dwattr $C$DW$63, DW_AT_TI_symbol_name("RAM_PE_RAW")
     952        .dwattr $C$DW$63, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     953        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     955        .dwattr $C$DW$63, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     956        .dwattr $C$DW$63, DW_AT_decl_line(0x8b)
     957        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     958$C$DW$64        .dwtag  DW_TAG_member
     959        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     960        .dwattr $C$DW$64, DW_AT_name("rsvd20")
     961        .dwattr $C$DW$64, DW_AT_TI_symbol_name("rsvd20")
     962        .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     963        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     965        .dwattr $C$DW$64, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     966        .dwattr $C$DW$64, DW_AT_decl_line(0x8c)
     967        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     968        .dwendtag $C$DW$T$24
     969
     970        .dwattr $C$DW$T$24, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
     971        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     972        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     973$C$DW$T$58      .dwtag  DW_TAG_volatile_type
     974        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$24)
     975
     976$C$DW$T$25      .dwtag  DW_TAG_structure_type
     977        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     978$C$DW$65        .dwtag  DW_TAG_member
     979        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     980        .dwattr $C$DW$65, DW_AT_name("PRU0_IMEM_PE")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   19

     981        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     982        .dwattr $C$DW$65, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     983        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     985        .dwattr $C$DW$65, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     986        .dwattr $C$DW$65, DW_AT_decl_line(0x96)
     987        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     988$C$DW$66        .dwtag  DW_TAG_member
     989        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     990        .dwattr $C$DW$66, DW_AT_name("PRU0_DMEM_PE")
     991        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     992        .dwattr $C$DW$66, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     993        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     995        .dwattr $C$DW$66, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
     996        .dwattr $C$DW$66, DW_AT_decl_line(0x97)
     997        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     998$C$DW$67        .dwtag  DW_TAG_member
     999        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1000        .dwattr $C$DW$67, DW_AT_name("PRU1_IMEM_PE")
    1001        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1002        .dwattr $C$DW$67, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1003        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1005        .dwattr $C$DW$67, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1006        .dwattr $C$DW$67, DW_AT_decl_line(0x98)
    1007        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1008$C$DW$68        .dwtag  DW_TAG_member
    1009        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1010        .dwattr $C$DW$68, DW_AT_name("PRU1_DMEM_PE")
    1011        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1012        .dwattr $C$DW$68, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1013        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1015        .dwattr $C$DW$68, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1016        .dwattr $C$DW$68, DW_AT_decl_line(0x99)
    1017        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1018$C$DW$69        .dwtag  DW_TAG_member
    1019        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1020        .dwattr $C$DW$69, DW_AT_name("RAM_PE")
    1021        .dwattr $C$DW$69, DW_AT_TI_symbol_name("RAM_PE")
    1022        .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1023        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1025        .dwattr $C$DW$69, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1026        .dwattr $C$DW$69, DW_AT_decl_line(0x9a)
    1027        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1028$C$DW$70        .dwtag  DW_TAG_member
    1029        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1030        .dwattr $C$DW$70, DW_AT_name("rsvd20")
    1031        .dwattr $C$DW$70, DW_AT_TI_symbol_name("rsvd20")
    1032        .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1033        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1035        .dwattr $C$DW$70, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   20

    1036        .dwattr $C$DW$70, DW_AT_decl_line(0x9b)
    1037        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1038        .dwendtag $C$DW$T$25
    1039
    1040        .dwattr $C$DW$T$25, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1041        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1042        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1043$C$DW$T$60      .dwtag  DW_TAG_volatile_type
    1044        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$25)
    1045
    1046$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1047        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1048$C$DW$71        .dwtag  DW_TAG_member
    1049        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1050        .dwattr $C$DW$71, DW_AT_name("PRU0_IMEM_PE_SET")
    1051        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1052        .dwattr $C$DW$71, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1053        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1055        .dwattr $C$DW$71, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1056        .dwattr $C$DW$71, DW_AT_decl_line(0xa4)
    1057        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1058$C$DW$72        .dwtag  DW_TAG_member
    1059        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1060        .dwattr $C$DW$72, DW_AT_name("PRU0_DMEM_PE_SET")
    1061        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1062        .dwattr $C$DW$72, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1063        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1065        .dwattr $C$DW$72, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1066        .dwattr $C$DW$72, DW_AT_decl_line(0xa5)
    1067        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1068$C$DW$73        .dwtag  DW_TAG_member
    1069        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1070        .dwattr $C$DW$73, DW_AT_name("PRU1_IMEM_PE_SET")
    1071        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1072        .dwattr $C$DW$73, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1073        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1075        .dwattr $C$DW$73, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1076        .dwattr $C$DW$73, DW_AT_decl_line(0xa6)
    1077        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1078$C$DW$74        .dwtag  DW_TAG_member
    1079        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1080        .dwattr $C$DW$74, DW_AT_name("PRU1_DMEM_PE_SET")
    1081        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1082        .dwattr $C$DW$74, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1083        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1085        .dwattr $C$DW$74, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1086        .dwattr $C$DW$74, DW_AT_decl_line(0xa7)
    1087        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1088$C$DW$75        .dwtag  DW_TAG_member
    1089        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1090        .dwattr $C$DW$75, DW_AT_name("RAM_PE_SET")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   21

    1091        .dwattr $C$DW$75, DW_AT_TI_symbol_name("RAM_PE_SET")
    1092        .dwattr $C$DW$75, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1093        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1095        .dwattr $C$DW$75, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1096        .dwattr $C$DW$75, DW_AT_decl_line(0xa8)
    1097        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1098$C$DW$76        .dwtag  DW_TAG_member
    1099        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1100        .dwattr $C$DW$76, DW_AT_name("rsvd20")
    1101        .dwattr $C$DW$76, DW_AT_TI_symbol_name("rsvd20")
    1102        .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1103        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1105        .dwattr $C$DW$76, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1106        .dwattr $C$DW$76, DW_AT_decl_line(0xa9)
    1107        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1108        .dwendtag $C$DW$T$26
    1109
    1110        .dwattr $C$DW$T$26, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1111        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1112        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1113$C$DW$T$62      .dwtag  DW_TAG_volatile_type
    1114        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
    1115
    1116$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1117        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1118$C$DW$77        .dwtag  DW_TAG_member
    1119        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1120        .dwattr $C$DW$77, DW_AT_name("PRU0_IMEM_PE_CLR")
    1121        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1122        .dwattr $C$DW$77, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1123        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1125        .dwattr $C$DW$77, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1126        .dwattr $C$DW$77, DW_AT_decl_line(0xb3)
    1127        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1128$C$DW$78        .dwtag  DW_TAG_member
    1129        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1130        .dwattr $C$DW$78, DW_AT_name("PRU0_DMEM_PE_CLR")
    1131        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1132        .dwattr $C$DW$78, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1133        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1135        .dwattr $C$DW$78, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1136        .dwattr $C$DW$78, DW_AT_decl_line(0xb4)
    1137        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1138$C$DW$79        .dwtag  DW_TAG_member
    1139        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1140        .dwattr $C$DW$79, DW_AT_name("PRU1_IMEM_PE_CLR")
    1141        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1142        .dwattr $C$DW$79, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1143        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1145        .dwattr $C$DW$79, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   22

    1146        .dwattr $C$DW$79, DW_AT_decl_line(0xb5)
    1147        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1148$C$DW$80        .dwtag  DW_TAG_member
    1149        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1150        .dwattr $C$DW$80, DW_AT_name("PRU1_DMEM_PE_CLR")
    1151        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1152        .dwattr $C$DW$80, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1153        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1155        .dwattr $C$DW$80, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1156        .dwattr $C$DW$80, DW_AT_decl_line(0xb6)
    1157        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1158$C$DW$81        .dwtag  DW_TAG_member
    1159        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1160        .dwattr $C$DW$81, DW_AT_name("rsvd16")
    1161        .dwattr $C$DW$81, DW_AT_TI_symbol_name("rsvd16")
    1162        .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1163        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1165        .dwattr $C$DW$81, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1166        .dwattr $C$DW$81, DW_AT_decl_line(0xb7)
    1167        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1168        .dwendtag $C$DW$T$27
    1169
    1170        .dwattr $C$DW$T$27, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1171        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1172        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1173$C$DW$T$64      .dwtag  DW_TAG_volatile_type
    1174        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$27)
    1175
    1176$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1177        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1178$C$DW$82        .dwtag  DW_TAG_member
    1179        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1180        .dwattr $C$DW$82, DW_AT_name("PMAO_PRU0")
    1181        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PMAO_PRU0")
    1182        .dwattr $C$DW$82, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1183        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1184        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1185        .dwattr $C$DW$82, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1186        .dwattr $C$DW$82, DW_AT_decl_line(0xc4)
    1187        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1188$C$DW$83        .dwtag  DW_TAG_member
    1189        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1190        .dwattr $C$DW$83, DW_AT_name("PMAO_PRU1")
    1191        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PMAO_PRU1")
    1192        .dwattr $C$DW$83, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1193        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1195        .dwattr $C$DW$83, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1196        .dwattr $C$DW$83, DW_AT_decl_line(0xc5)
    1197        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1198$C$DW$84        .dwtag  DW_TAG_member
    1199        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1200        .dwattr $C$DW$84, DW_AT_name("rsvd2")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   23

    1201        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1202        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1203        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1205        .dwattr $C$DW$84, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1206        .dwattr $C$DW$84, DW_AT_decl_line(0xc6)
    1207        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1208        .dwendtag $C$DW$T$28
    1209
    1210        .dwattr $C$DW$T$28, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1211        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1212        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1213$C$DW$T$66      .dwtag  DW_TAG_volatile_type
    1214        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$28)
    1215
    1216$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1217        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1218$C$DW$85        .dwtag  DW_TAG_member
    1219        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1220        .dwattr $C$DW$85, DW_AT_name("OCP_EN")
    1221        .dwattr $C$DW$85, DW_AT_TI_symbol_name("OCP_EN")
    1222        .dwattr $C$DW$85, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1223        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1224        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1225        .dwattr $C$DW$85, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1226        .dwattr $C$DW$85, DW_AT_decl_line(0xd3)
    1227        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1228$C$DW$86        .dwtag  DW_TAG_member
    1229        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1230        .dwattr $C$DW$86, DW_AT_name("rsvd1")
    1231        .dwattr $C$DW$86, DW_AT_TI_symbol_name("rsvd1")
    1232        .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1233        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1235        .dwattr $C$DW$86, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1236        .dwattr $C$DW$86, DW_AT_decl_line(0xd4)
    1237        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1238        .dwendtag $C$DW$T$29
    1239
    1240        .dwattr $C$DW$T$29, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1241        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1242        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1243$C$DW$T$68      .dwtag  DW_TAG_volatile_type
    1244        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
    1245
    1246$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1247        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1248$C$DW$87        .dwtag  DW_TAG_member
    1249        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1250        .dwattr $C$DW$87, DW_AT_name("PRU1_PAD_HP_EN")
    1251        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1252        .dwattr $C$DW$87, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1253        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1255        .dwattr $C$DW$87, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   24

    1256        .dwattr $C$DW$87, DW_AT_decl_line(0xde)
    1257        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1258$C$DW$88        .dwtag  DW_TAG_member
    1259        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1260        .dwattr $C$DW$88, DW_AT_name("XFR_SHIFT_EN")
    1261        .dwattr $C$DW$88, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1262        .dwattr $C$DW$88, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1263        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1265        .dwattr $C$DW$88, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1266        .dwattr $C$DW$88, DW_AT_decl_line(0xdf)
    1267        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1268$C$DW$89        .dwtag  DW_TAG_member
    1269        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1270        .dwattr $C$DW$89, DW_AT_name("rsvd2")
    1271        .dwattr $C$DW$89, DW_AT_TI_symbol_name("rsvd2")
    1272        .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1273        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1275        .dwattr $C$DW$89, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1276        .dwattr $C$DW$89, DW_AT_decl_line(0xe0)
    1277        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1278        .dwendtag $C$DW$T$30
    1279
    1280        .dwattr $C$DW$T$30, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1281        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1282        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1283$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    1284        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$30)
    1285
    1286$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1287        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1288$C$DW$90        .dwtag  DW_TAG_member
    1289        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1290        .dwattr $C$DW$90, DW_AT_name("PIN_MUX_SEL")
    1291        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1292        .dwattr $C$DW$90, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1293        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1295        .dwattr $C$DW$90, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1296        .dwattr $C$DW$90, DW_AT_decl_line(0xec)
    1297        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1298$C$DW$91        .dwtag  DW_TAG_member
    1299        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1300        .dwattr $C$DW$91, DW_AT_name("rsvd2")
    1301        .dwattr $C$DW$91, DW_AT_TI_symbol_name("rsvd2")
    1302        .dwattr $C$DW$91, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1303        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1305        .dwattr $C$DW$91, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1306        .dwattr $C$DW$91, DW_AT_decl_line(0xed)
    1307        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1308        .dwendtag $C$DW$T$31
    1309
    1310        .dwattr $C$DW$T$31, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   25

    1311        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1312        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1313$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    1314        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$31)
    1315
    1316$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1317        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1318$C$DW$92        .dwtag  DW_TAG_member
    1319        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$49)
    1320        .dwattr $C$DW$92, DW_AT_name("$P$T0")
    1321        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T0")
    1322        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1324        .dwattr $C$DW$92, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1325        .dwattr $C$DW$92, DW_AT_decl_line(0x29)
    1326        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1327$C$DW$93        .dwtag  DW_TAG_member
    1328        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$51)
    1329        .dwattr $C$DW$93, DW_AT_name("$P$T1")
    1330        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T1")
    1331        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1332        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$93, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1334        .dwattr $C$DW$93, DW_AT_decl_line(0x33)
    1335        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1336$C$DW$94        .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$53)
    1338        .dwattr $C$DW$94, DW_AT_name("$P$T2")
    1339        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T2")
    1340        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1341        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1342        .dwattr $C$DW$94, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1343        .dwattr $C$DW$94, DW_AT_decl_line(0x41)
    1344        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
    1345$C$DW$95        .dwtag  DW_TAG_member
    1346        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$55)
    1347        .dwattr $C$DW$95, DW_AT_name("$P$T3")
    1348        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T3")
    1349        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1350        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1351        .dwattr $C$DW$95, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1352        .dwattr $C$DW$95, DW_AT_decl_line(0x54)
    1353        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1354$C$DW$96        .dwtag  DW_TAG_member
    1355        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$57)
    1356        .dwattr $C$DW$96, DW_AT_name("$P$T4")
    1357        .dwattr $C$DW$96, DW_AT_TI_symbol_name("$P$T4")
    1358        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1359        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1360        .dwattr $C$DW$96, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1361        .dwattr $C$DW$96, DW_AT_decl_line(0x67)
    1362        .dwattr $C$DW$96, DW_AT_decl_column(0x02)
    1363$C$DW$97        .dwtag  DW_TAG_member
    1364        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$59)
    1365        .dwattr $C$DW$97, DW_AT_name("$P$T5")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   26

    1366        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T5")
    1367        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1368        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1369        .dwattr $C$DW$97, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1370        .dwattr $C$DW$97, DW_AT_decl_line(0x83)
    1371        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1372$C$DW$98        .dwtag  DW_TAG_member
    1373        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$61)
    1374        .dwattr $C$DW$98, DW_AT_name("$P$T6")
    1375        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T6")
    1376        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1377        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1378        .dwattr $C$DW$98, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1379        .dwattr $C$DW$98, DW_AT_decl_line(0x92)
    1380        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1381$C$DW$99        .dwtag  DW_TAG_member
    1382        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$63)
    1383        .dwattr $C$DW$99, DW_AT_name("$P$T7")
    1384        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T7")
    1385        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1386        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1387        .dwattr $C$DW$99, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build_
    1388        .dwattr $C$DW$99, DW_AT_decl_line(0xa0)
    1389        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1390$C$DW$100       .dwtag  DW_TAG_member
    1391        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$65)
    1392        .dwattr $C$DW$100, DW_AT_name("$P$T8")
    1393        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T8")
    1394        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1395        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1396        .dwattr $C$DW$100, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1397        .dwattr $C$DW$100, DW_AT_decl_line(0xaf)
    1398        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1399$C$DW$101       .dwtag  DW_TAG_member
    1400        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$32)
    1401        .dwattr $C$DW$101, DW_AT_name("rsvd24")
    1402        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd24")
    1403        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1404        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1405        .dwattr $C$DW$101, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1406        .dwattr $C$DW$101, DW_AT_decl_line(0xbc)
    1407        .dwattr $C$DW$101, DW_AT_decl_column(0x0b)
    1408$C$DW$102       .dwtag  DW_TAG_member
    1409        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$67)
    1410        .dwattr $C$DW$102, DW_AT_name("$P$T9")
    1411        .dwattr $C$DW$102, DW_AT_TI_symbol_name("$P$T9")
    1412        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1413        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1414        .dwattr $C$DW$102, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1415        .dwattr $C$DW$102, DW_AT_decl_line(0xc0)
    1416        .dwattr $C$DW$102, DW_AT_decl_column(0x02)
    1417$C$DW$103       .dwtag  DW_TAG_member
    1418        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$33)
    1419        .dwattr $C$DW$103, DW_AT_name("rsvd2c")
    1420        .dwattr $C$DW$103, DW_AT_TI_symbol_name("rsvd2c")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   27

    1421        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1422        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1423        .dwattr $C$DW$103, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1424        .dwattr $C$DW$103, DW_AT_decl_line(0xcb)
    1425        .dwattr $C$DW$103, DW_AT_decl_column(0x0b)
    1426$C$DW$104       .dwtag  DW_TAG_member
    1427        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$69)
    1428        .dwattr $C$DW$104, DW_AT_name("$P$T10")
    1429        .dwattr $C$DW$104, DW_AT_TI_symbol_name("$P$T10")
    1430        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1431        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1432        .dwattr $C$DW$104, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1433        .dwattr $C$DW$104, DW_AT_decl_line(0xcf)
    1434        .dwattr $C$DW$104, DW_AT_decl_column(0x02)
    1435$C$DW$105       .dwtag  DW_TAG_member
    1436        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$71)
    1437        .dwattr $C$DW$105, DW_AT_name("$P$T11")
    1438        .dwattr $C$DW$105, DW_AT_TI_symbol_name("$P$T11")
    1439        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1440        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1441        .dwattr $C$DW$105, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1442        .dwattr $C$DW$105, DW_AT_decl_line(0xda)
    1443        .dwattr $C$DW$105, DW_AT_decl_column(0x02)
    1444$C$DW$106       .dwtag  DW_TAG_member
    1445        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$34)
    1446        .dwattr $C$DW$106, DW_AT_name("rsvd38")
    1447        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd38")
    1448        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1449        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1450        .dwattr $C$DW$106, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1451        .dwattr $C$DW$106, DW_AT_decl_line(0xe5)
    1452        .dwattr $C$DW$106, DW_AT_decl_column(0x0b)
    1453$C$DW$107       .dwtag  DW_TAG_member
    1454        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$73)
    1455        .dwattr $C$DW$107, DW_AT_name("$P$T12")
    1456        .dwattr $C$DW$107, DW_AT_TI_symbol_name("$P$T12")
    1457        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1458        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1459        .dwattr $C$DW$107, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1460        .dwattr $C$DW$107, DW_AT_decl_line(0xe8)
    1461        .dwattr $C$DW$107, DW_AT_decl_column(0x02)
    1462        .dwendtag $C$DW$T$35
    1463
    1464        .dwattr $C$DW$T$35, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1465        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1466        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1467$C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1468        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$35)
    1469        .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1470        .dwattr $C$DW$T$98, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1471        .dwattr $C$DW$T$98, DW_AT_decl_line(0xf0)
    1472        .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    1473$C$DW$T$99      .dwtag  DW_TAG_volatile_type
    1474        .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    1475
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   28

    1476$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1477        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1478$C$DW$108       .dwtag  DW_TAG_member
    1479        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1480        .dwattr $C$DW$108, DW_AT_name("C28_BLK_POINTER")
    1481        .dwattr $C$DW$108, DW_AT_TI_symbol_name("C28_BLK_POINTER")
    1482        .dwattr $C$DW$108, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x10)
    1483        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1485        .dwattr $C$DW$108, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1486        .dwattr $C$DW$108, DW_AT_decl_line(0x85)
    1487        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1488$C$DW$109       .dwtag  DW_TAG_member
    1489        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1490        .dwattr $C$DW$109, DW_AT_name("C29_BLK_POINTER")
    1491        .dwattr $C$DW$109, DW_AT_TI_symbol_name("C29_BLK_POINTER")
    1492        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1493        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1495        .dwattr $C$DW$109, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1496        .dwattr $C$DW$109, DW_AT_decl_line(0x86)
    1497        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1498        .dwendtag $C$DW$T$36
    1499
    1500        .dwattr $C$DW$T$36, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1501        .dwattr $C$DW$T$36, DW_AT_decl_line(0x84)
    1502        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1503$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1504        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1505
    1506$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1507        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1508$C$DW$110       .dwtag  DW_TAG_member
    1509        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1510        .dwattr $C$DW$110, DW_AT_name("SOFT_RST_N")
    1511        .dwattr $C$DW$110, DW_AT_TI_symbol_name("SOFT_RST_N")
    1512        .dwattr $C$DW$110, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1513        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1515        .dwattr $C$DW$110, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1516        .dwattr $C$DW$110, DW_AT_decl_line(0x2d)
    1517        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1518$C$DW$111       .dwtag  DW_TAG_member
    1519        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1520        .dwattr $C$DW$111, DW_AT_name("EN")
    1521        .dwattr $C$DW$111, DW_AT_TI_symbol_name("EN")
    1522        .dwattr $C$DW$111, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1523        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1525        .dwattr $C$DW$111, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1526        .dwattr $C$DW$111, DW_AT_decl_line(0x2e)
    1527        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1528$C$DW$112       .dwtag  DW_TAG_member
    1529        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1530        .dwattr $C$DW$112, DW_AT_name("SLEEPING")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   29

    1531        .dwattr $C$DW$112, DW_AT_TI_symbol_name("SLEEPING")
    1532        .dwattr $C$DW$112, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1533        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1535        .dwattr $C$DW$112, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1536        .dwattr $C$DW$112, DW_AT_decl_line(0x2f)
    1537        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1538$C$DW$113       .dwtag  DW_TAG_member
    1539        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1540        .dwattr $C$DW$113, DW_AT_name("CTR_EN")
    1541        .dwattr $C$DW$113, DW_AT_TI_symbol_name("CTR_EN")
    1542        .dwattr $C$DW$113, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1543        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1545        .dwattr $C$DW$113, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1546        .dwattr $C$DW$113, DW_AT_decl_line(0x30)
    1547        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1548$C$DW$114       .dwtag  DW_TAG_member
    1549        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1550        .dwattr $C$DW$114, DW_AT_name("rsvd4")
    1551        .dwattr $C$DW$114, DW_AT_TI_symbol_name("rsvd4")
    1552        .dwattr $C$DW$114, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1553        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1555        .dwattr $C$DW$114, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1556        .dwattr $C$DW$114, DW_AT_decl_line(0x31)
    1557        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1558$C$DW$115       .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1560        .dwattr $C$DW$115, DW_AT_name("SINGLE_STEP")
    1561        .dwattr $C$DW$115, DW_AT_TI_symbol_name("SINGLE_STEP")
    1562        .dwattr $C$DW$115, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1563        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1565        .dwattr $C$DW$115, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1566        .dwattr $C$DW$115, DW_AT_decl_line(0x32)
    1567        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1568$C$DW$116       .dwtag  DW_TAG_member
    1569        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1570        .dwattr $C$DW$116, DW_AT_name("rsvd9")
    1571        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd9")
    1572        .dwattr $C$DW$116, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x06)
    1573        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1575        .dwattr $C$DW$116, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1576        .dwattr $C$DW$116, DW_AT_decl_line(0x33)
    1577        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1578$C$DW$117       .dwtag  DW_TAG_member
    1579        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1580        .dwattr $C$DW$117, DW_AT_name("RUNSTATE")
    1581        .dwattr $C$DW$117, DW_AT_TI_symbol_name("RUNSTATE")
    1582        .dwattr $C$DW$117, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1583        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1585        .dwattr $C$DW$117, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   30

    1586        .dwattr $C$DW$117, DW_AT_decl_line(0x34)
    1587        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1588$C$DW$118       .dwtag  DW_TAG_member
    1589        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1590        .dwattr $C$DW$118, DW_AT_name("PCTR_RST_VAL")
    1591        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PCTR_RST_VAL")
    1592        .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1593        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1595        .dwattr $C$DW$118, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1596        .dwattr $C$DW$118, DW_AT_decl_line(0x35)
    1597        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1598        .dwendtag $C$DW$T$37
    1599
    1600        .dwattr $C$DW$T$37, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1601        .dwattr $C$DW$T$37, DW_AT_decl_line(0x2c)
    1602        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1603$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    1604        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$37)
    1605
    1606$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1607        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1608$C$DW$119       .dwtag  DW_TAG_member
    1609        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1610        .dwattr $C$DW$119, DW_AT_name("PCTR")
    1611        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PCTR")
    1612        .dwattr $C$DW$119, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x10)
    1613        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1615        .dwattr $C$DW$119, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1616        .dwattr $C$DW$119, DW_AT_decl_line(0x3f)
    1617        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1618$C$DW$120       .dwtag  DW_TAG_member
    1619        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1620        .dwattr $C$DW$120, DW_AT_name("rsvd16")
    1621        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd16")
    1622        .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1623        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1625        .dwattr $C$DW$120, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1626        .dwattr $C$DW$120, DW_AT_decl_line(0x40)
    1627        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1628        .dwendtag $C$DW$T$38
    1629
    1630        .dwattr $C$DW$T$38, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1631        .dwattr $C$DW$T$38, DW_AT_decl_line(0x3e)
    1632        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1633$C$DW$T$78      .dwtag  DW_TAG_volatile_type
    1634        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$38)
    1635
    1636$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1637        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1638$C$DW$121       .dwtag  DW_TAG_member
    1639        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1640        .dwattr $C$DW$121, DW_AT_name("BITWISE_ENS")
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   31

    1641        .dwattr $C$DW$121, DW_AT_TI_symbol_name("BITWISE_ENS")
    1642        .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1643        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1645        .dwattr $C$DW$121, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1646        .dwattr $C$DW$121, DW_AT_decl_line(0x4a)
    1647        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1648        .dwendtag $C$DW$T$39
    1649
    1650        .dwattr $C$DW$T$39, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1651        .dwattr $C$DW$T$39, DW_AT_decl_line(0x49)
    1652        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1653$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1654        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$39)
    1655
    1656$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1657        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1658$C$DW$122       .dwtag  DW_TAG_member
    1659        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1660        .dwattr $C$DW$122, DW_AT_name("CYCLECOUNT")
    1661        .dwattr $C$DW$122, DW_AT_TI_symbol_name("CYCLECOUNT")
    1662        .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1663        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1665        .dwattr $C$DW$122, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1666        .dwattr $C$DW$122, DW_AT_decl_line(0x54)
    1667        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1668        .dwendtag $C$DW$T$40
    1669
    1670        .dwattr $C$DW$T$40, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1671        .dwattr $C$DW$T$40, DW_AT_decl_line(0x53)
    1672        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1673$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    1674        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$40)
    1675
    1676$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1677        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1678$C$DW$123       .dwtag  DW_TAG_member
    1679        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1680        .dwattr $C$DW$123, DW_AT_name("STALLCOUNT")
    1681        .dwattr $C$DW$123, DW_AT_TI_symbol_name("STALLCOUNT")
    1682        .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1683        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1685        .dwattr $C$DW$123, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1686        .dwattr $C$DW$123, DW_AT_decl_line(0x5e)
    1687        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1688        .dwendtag $C$DW$T$41
    1689
    1690        .dwattr $C$DW$T$41, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_buil
    1691        .dwattr $C$DW$T$41, DW_AT_decl_line(0x5d)
    1692        .dwattr $C$DW$T$41, DW_AT_decl_column(0x14)
    1693$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    1694        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    1695
PRU Assembler Unix v2.1.4 Mon Apr  1 15:37:25 2019

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
PRU_experiment_UART.asm                                              PAGE   32

    1696$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1697        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1698$C$DW$124       .dwtag  DW_TAG_member
    1699        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1700        .dwattr $C$DW$124, DW_AT_name("C24_BLK_IDX")
    1701        .dwattr $C$DW$124, DW_AT_TI_symbol_name("C24_BLK_IDX")
    1702        .dwattr $C$DW$124, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1703        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1705        .dwattr $C$DW$124, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1706        .dwattr $C$DW$124, DW_AT_decl_line(0x6b)
    1707        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1708$C$DW$125       .dwtag  DW_TAG_member
    1709        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1710        .dwattr $C$DW$125, DW_AT_name("rsvd8")
    1711        .dwattr $C$DW$125, DW_AT_TI_symbol_name("rsvd8")
    1712        .dwattr $C$DW$125, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x08)
    1713        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1715        .dwattr $C$DW$125, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1716        .dwattr $C$DW$125, DW_AT_decl_line(0x6c)
    1717        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1718$C$DW$126       .dwtag  DW_TAG_member
    1719        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1720        .dwattr $C$DW$126, DW_AT_name("C25_BLK_IDX")
    1721        .dwattr $C$DW$126, DW_AT_TI_symbol_name("C25_BLK_IDX")
    1722        .dwattr $C$DW$126, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1723        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1724        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1725        .dwattr $C$DW$126, DW_AT_decl_file("/home/arturs/AE_Custom_Linux_kernels_Yocto/non-yocto_build
    1726        .dwattr $C$DW$126, DW_AT_decl_line(0x6d)
    1727        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1728$C$DW$127       .dwtag  DW_TAG_member
    1729        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1730        .dwattr $C$DW$127, DW_AT_name("rsvd24")
    1731        .dwattr $C$DW$127, DW_AT_TI_symbol_name("rsvd24")
